{
    "DonutMan": "When he woke me, it was still dark. I would been curled into the passenger seat of the van while he stripped and waxed the tile of a Jiffy Lube. “Beak,” he said. “Let us get after it.” “It” was money. I knew because, for the past few months, we spent our unsupervised visitations working one of his businesses. My father never had a steady paycheck. His odd jobs rewarded only hustle. I was nine - when I stayed with him, he would sleep through the afternoon while I read for school or played Gameboy, then rush me through dinner to make it to a flooring job. We showed up late after the businesses had closed. I would help him unload the van, sometimes sweep or mop, but I was too young for the thin hours of the night. When I got tired, I lay down in front seat, the whir of cars lulling me to sleep as they passed. There were days I would wake up while we were on the go, unaware of the movement, but on nights when the job ran long, nights like this one, we went straight to the donut factory. This was before Krispy Kreme had their own stores, before they had a station in every Giant and Safeway up the coast and still garnered interest in their rarity. Guys like my father - hands raw from disinfectant, the soles of his New Balance slick with wax - showed up with the sun to stuff their vehicles with the green and white boxes, hoping to resell them and pocket the markup. It was the Saturday before Thanksgiving, and holidays made for easy sales, but even so, I knew we would have trouble unloading the amount he insisted on buying. His Aerostar van was a windowless smoky black with the chrome stripped off. While he loaded boxes in the back of it from floor mat to bare ceiling, careful to keep everything separate from the mop buckets, the floor buffer, I watched the workers make donuts in the back of the factory through the viewing window. The circles of dough drift along in a river of oil, starting soft white, dropped straight from the dispenser and ending on the drying rack, golden-brown, the sugar coming up in fumes. “Beak, get your face off the glass,” he said. My father called me “Beak” because, while we were both Chinese, I had not yet grown into my mom’s British nose. We had not spent more than a weekend together since the divorce four years prior. He took his billfold from his pocket, peeled off a couple ones and handed it the floor manager who knocked on the glass and held up two fingers. On the other side of the window, the bakers wore plastic aprons and latex gloves, hairnets and safety goggles. They took two donuts straight off the conveyer belt, slid them in a wax paper sleeve and brought them out to us. The heat of the pastry in my hands created a hunger I had not known, and I swallowed the donut in three bites. It was barely solid, so sweet it made my teeth ache, and I wanted another immediately. “When was the last time your mom fed you something this good for breakfast?” I was too busy licking the glaze off the back of my teeth to think about my usual breakfast - the off - brand cheerios dense as cardboard wet with rice milk, both donated from the church my mother dragged me to. Depending how far we were from her last paycheck, the meals became less complex. At first, pasta, homemade sauce, sautéed vegetables, salted chicken, and a week later, plain rice, canned tuna, soy sauce for flavor. Those meals, she would stir her food between bites, as if it were hiding beneath it something worth savoring. I often tried to choose relative hunger instead of clearing my plate. We would push it back and forth between us on the table until she would slam a fist down, saying, “Eat, dammit. I do not work this hard for you to spit in my face.” There was something raw in her tone. When the dishes stopped rattling, her voice cooled. “I am sorry, baby. Please.” Our route took us from the factory back toward his basement studio. We used to hit the strips of business parks and car lots congesting the main roads reaching out from 495 and the District. Rockville, Gaithersburg, College Park, Laurel - any hospitality service that needed giveaways or a staff that might want breakfast. The spots my father sold to often, the receptionists would declare ‘Donut Man!” as we came through the door, boxes stacked on my forearms. When we were entered somewhere new, he said it himself. At a car dealership, he leaned against the counter, speaking to a woman on the other side. The Tag Heuer watch hanging from his wrist was older than me. One time my mother joked that it would been in and out of pawnshops as often as my father had been in and out of jail. The mention of prison took the humor from her face. “Mind your manners, Jason,” he said. “Tell Miss Cindy hello.” As a kid, I would been mild in temperament - bad at making eye contact, prone to long passages of silence - but we were a father/son sales team, and part of that act required me to smile when addressed. I am not sure when my big - gummed grin became genuine, warmed by the attention. I said hi as my father opened the box on the top of the stack. Miss Cindy looked at the variety dozen, then me, saying, “Well, I do not know which is sweeter.” We set the donuts on the counter, folded bills, returned to the van to restock. My father only really taught me two things in life. The first was how to take money off people who had it to spend. We were on the beltway, and he decided we could sell more if we split up. Awake all night cleaning floors, he was beginning to fade as the day wore on. He would not admit it, but his eyes were ringed red, and we would barely made a dent in the product. I was worried that no one would want to buy from just me - no jewelry, no swagger or familiarity - but he assured me, saying, “All you got to do is treat them like you love them. Bat your eyes a little. If they do not want to buy, hey, no sweat, see you next time. Thanks anyway. You cannot make anyone do anything.” The next stop in Tacoma Park, he gave me enough cash to make change, then put me out on my own. We priced a dozen glazed at ten, the assorted boxes of jelly and chocolate and Bavarian creams for thirteen, one of each for twenty. I kept repeating this pitch in my head as I went into the stores. My first few attempts - a laundry mat, a Radioshack, the Post Office - were met with polite rejections. I was too courteous, entering silently and waiting in line. The mail clerk behind the glass barricade looked at the boxes, then over my head and toward the door before saying no with a smile. I crossed the street, my arms shaking a bit under the weight of the boxes. There was a bank on the corner, and as I approached the wide, double doors, a woman held one open for me, saying, “Are not you precious.” Part of me worried I was moving too slowly, that I would have kept my father waiting and his impatience would turn to anger or disappointment. Part of me worried I would come back without making a sale. I walked past the velvet ropes and the stanchions that formed a queue to the tellers toward a man sitting at the desk in the middle of the lobby. I said “Krispy Kreme!” when I was within ear shot. He said, “Well what have you got here?” and I gave him the pitch, the pricing. The bank manager was older, his hair thin at the temples, silver roses patterned across his tie. He told me they had a meeting coming up in an hour, and would not it be nice to provide some refreshments for the brokers and reps that morning? He bought everything I was carrying, and I skipped back to the van waving the cash like a trophy. My father had just closed the sliding door. When he saw me, he snatched the money from my hand, a bit of spit coming off his lip as he asked me if I was stupid. He said, “You know the best way to lose something, Beak? Let someone know you have it to lose.” In the passenger seat, I shrunk into the cushion, resting my head against the doorframe. He closed the door and sat, joining the money I would earned with the roll in his pocket. Before we left the parking lot, he took his bifocals off and polished the dust from the lenses. He said, “You need to know how to be careful.” Always count the money by the door. The trick is to keep small bills on the outside and stow it in your front pocket where it is hard to get to. The skin on his knuckles looked like worn leather sliding into his jeans, his old graduation ring studding his pinky. To this day, I have never misplaced a bill. Each stop, we split up. Halfway around the beltway, I came back from my rounds to find him napping. With the holiday around the corner and a bit of encouragement, people were looking for excuses to indulge. The ease of the sales only fueled this new confidence. Each time I came back to the van, empty-handed, I was fired up. Eventually, my mom would lock him up again for falling too far behind on the child support, but just then, I rode shotgun, a stomach made for sugar and a newfound love of counting cash. Stop after stop, while he napped, I hefted the donuts into my arms, brought the boxes into doctor’s offices and furniture stores, real estate headquarters and used car lots, pulling back the glass and saying, “Krispy Kreme!” I woke him when we needed to move, and halfway around the beltway, I sold the last dozen glazed to a dentist off Route 1. The wad in my pocket was so thick my pants fit tighter. I knuckled him in the bicep, and he rubbed his eyes, pushed his bifocals up the bridge of his nose. He said, “Where to?” “Home.” “We have got work to do, Beak,” he said. The cough in his waking throat sounded thick with mucous. “Where to?” “Home,” I said. “They are all gone.” Maybe it was exhaustion, but the wrinkled brow, the pinched confusion of his expression made me feel like I was lying to him. He turned in the seat to the belly of the van, empty now except for the cleaning supplies, the comforter that covered them. When he smiled, I could see the gold crowns glowing like embers in the back of his mouth. He dropped the van into gear and put us on the road. On good days, we would get wings and rib - tips from a Chinese carry-out around the corner from his basement studio. We would each eat half of one dish then trade. Side by side, in the front of the van, we ate until our forks scraped the bottom of the styrofoam trays, until we unbuttoned our jeans to get comfortable. “Your mother and I used to live above a spot like this in Wheaton. The kitchen was below our bedroom. Just the smell of chicken would turn her stomach, but you know, I was always craving it,” he said. “I bet she still does not let you eat it.” “She says eating out is a waste of money.” Cartilage from the pork cracked between his teeth, and he grunted the bone into a napkin. My arms, my feet, ached from the hustle. In the driveway, we instinctively opened the sliding door on the van to carry in what we could not get rid of - the donuts we would eat for dinner. But I would sold us out. In my pocket was the proof. I showed it too him - the roll of bills suspended between us bulging out my fist, and I felt alive. “Hey, Donut man,” he said standing over me, inspecting the features of my face. I could see my reflection in his glasses, distorted by the curve of the lens. We were so much the same except for those small and important differences that are lost when the eye is not focused - how I do not fully recognize myself now when it is four in the morning and I am washing my face in the sink after a shift, the tips in my jeans still damp from the beer-slick bar; how, tired and worn thinner by liquor, I look out the window and cannot tell if the sun is coming soon or just gone. With his finger, he tapped me on the nose, saying, “Hand it over.”",
    "TheBridalSet": "I had forgotten that it was a city of plans. People made them, penciled them into calendars, popped their collars and showed up with honesty on their faces. In those days, I had none. What I had were some button-downs in a carry-on, a scraped and stinging elbow from an escalator incident at the airport, an empty booze cabinet with a single can of tonic water waiting for me at my hotel. It was Bombay in May. Glasses went milky when doors opened, when doors closed. I waited for Manish by the door of The Polo Bar, where a line for entry was beginning to form despite the early hour. As I waited, the rain beat the awning over my head in sheets, sounded like an animal being lashed. I was visiting India because I could tell from my wife’s face when she walked into a room that she had hoped I was not there. You can only see a woman’s face turn so swiftly, with such surety that the smile ought to disappear, so many times before you believe it might be time to change something about yourself, or in my case, to take a flight. So I was glad to be there, my collar encircled with damp, the air heavy with its familiar salt and whiff of petrol, my presence unremarked by the passing bodies who hurried towards and past me, into the bar. One of these bodies, burly and short in a black T-shirt that strained to make the distance across his chest and biceps, approached me the way you approach air conditioning: skin warm, arms splayed, smile rippling. In the days before we became husbands and fathers, before our real lives happened, Manish was a stud, a stallion, a St. Mary’s head boy, and eventually, a Rolex-wearing paper magnate. He was one of those mythological figures who received proposals through the ringing telephone, families from Lucknow and Hyderabad who saw him shimmering at so-and-so is wedding, families hoping they needed to arrange just one coffee between him and their newly graduated daughter to gain a son-in-law. The rest of us had to do it the hard way. You would show up freshly shaved to whatever second cousin’s friend’s house, sit in a corner with the girl’s father and brothers, hoping the girl in question spared you a single glance. Just one! And if she did, then the afternoon was spent in a spell of drowsy relief. Relief that Manish would never need to know, for when he was twenty-four, he had fallen in love with a London-born Delhi girl on a work trip, brought her home to Bombay, and watched pridefully as she went off on Marxist sermons in the corners of parties. But to their story too, there was a crisp turning of the lock that marked the end. After three decades, their marriage was over. Manish was on his own now, looking for work. The rumors of his rough patch, as we would come to call these phases of our lives, were floated to me through a chain of our oldest friends. The year before, returning home to India from a trip abroad, Manish had walked into his living room full of company executives—his uncles and brothers, his father, his petite wife at the head. He was advised to accept his share of assets and bow out of the business. They deemed him unfit to stand at the helm based on his penchant for luxury items. They pointed at his shoes, his watch, his gold-plated cufflinks, which he had recently gotten engraved with his initials, M. M. Ticking beneath this meeting and its excuses for Manish’s expulsion was a nastier, truer thread of news circulated on group chats that did not include him. They claimed that his wife, the Marxist, had fallen in love with Manish’s father. Together they had plotted to remove Manish from their lives. About this, people speculated, changed their stories, agreed and disagreed, but the verdict of the whole saga floated above their chatter like a big gray cloud that no one wanted to see. The fact was that parents and children alike could do unspeakable things. We walked through The Polo Bar slowly, like two men in trouble. It was a time in my life when I believed that everyone was suspicious of me. I felt they could see through to my brain, that endless list of knots I needed to untie in this lifetime. The bastards I needed to forgive and the bigger bastards I needed to forgive me. My unending roster of debts uncollected and owed. Would they ever stop accruing? I thought then that life was just that: a trip to the bank. You racked up credit, accidentally used it all, and found yourself sitting across from a teller in Malabar Hill, sliding a wad of rupee bills under the table, asking for access to your dead mother’s bank locker in order to liquidate her old wedding jewelry. As we walked to our table, I searched Manish’s profile for a glint of these stories, for a clue of our shared aloneness, but he had his teeth whitened recently and that was all I could see. Two rows of piano keys bright as mercury. I had been to The Polo Bar as a kid, snuck a sip of my father’s Macallan on the rocks and was smacked across the face for doing so. Back then the bar was a daytime visit, a post-newspaper and tea meeting point for the families of Malabar Hill who had been invited to join the club as members. You were either invited, referred, or given membership in the will of an aloof and long-dead parent or grandparent. It was a big deal back then to receive one of those handwritten invitations to interview at the Hill Club. If you made it through, it meant you were a well-talked-about family, a family with one Mama and one Papa, with no divorces or suicides rotting leaves on the family tree. What you got for your good reputation and sturdy financial sense was access to a tennis court, The Polo Bar, and a pale blue lap pool that no one used, because most apartment buildings on the hill had pools anyway. A group of people who seemed to know Manish floated over to say hello as we took our seats. I did not recognize any of them and did not feel the need to make new friends. I was slightly disturbed by how drastically the bar had changed. I looked up from the anonymous, powdered faces of Manish’s friends and saw what used to be. She Will-white walls, rattan furniture, bamboo ceiling fans that rotated slowly and uselessly overhead. A number of indoor plants, bright and unfurling, host to small swarms of insects that hovered permanently above their colors. No televisions, only an omnipresent radio that announced the highlights of whatever cricket match was happening that week. Sunlight would splash on the tables like paint, the day’s dust dipping and swirling around us. My little sister, her hair strung up in two asymmetrical ponytails, beaming demonically at me for anticipation of some prank she would pulled that I was not aware of just yet. Salt inside my glass of Coke, etcetera. Now the bar was polished and dark, a halfway imitation of an American dive. It was remodeled in the early 2000s with marbled wood and central air conditioning, a verbal history provided by the mustached manager, who trotted over at some point with a big slap on Manish’s shoulder. The air was dry and cool and our waiter brought over large jugs of iced water.It was a farewell to the delicious dampness that made places like this buzz, though I thought I felt a raindrop land on my skull. When I looked up, I saw that the fans had remained. They were frozen above us, those gorgeous, golden slats. Dirt was crusted over the blades like ash. “Politician—he is fit to be a politician,” Manish was saying to one of his cronies with a big smile, his finger ringed with a thick gold band, pointed at the man in question. Around us, people crowded at tables like insects to light, standing, sitting, one leg on a barstool, one off, arranging garments, checking pockets, checking purses. I saw a man a few tables over bring a hand to the dark space under the table and pull at his crotch. I felt the relief, too. Things falling back into place. I gave a strong imitation of someone who felt comfortable, laughing with all my teeth. Ha, ha, ha. People were dressed in rich colors, burgundy and beige. Hair bouncy, bright with shine or cropped close to the scalp, glistening with stiffness. The seams of their blouses seemed so perfectly snug that it was clear they had been tailored. Some of the women even looked at me. “Hey, darling,” they seemed to say. I felt myself harden at just the implication. I was trying to live in the moment more. If I was not thinking about money I was usually thinking about when I would enjoy my next drink. The thirst was tidal, deafening. It flapped wildly in my ears, gave everything a grayish tint that I worried would become permanent, black-and-white vision forever, like a dog’s. I allowed myself one slow breath to focus on what was around me, the promise of a drink close enough to suspend worry. The thought made me suddenly cheerful. Under my own spell, I heard the barroom chatter rise like it was controlled by a volume knob. Once Manish’s various greeters left, he looked at me with the high bite of someone who has been made to look good in public. Out of goodwill and impatience I ordered us a round of vodkas on ice, sliding my card out of its place slowly, carefully, praying Manish would object by presenting his own, but of course, he did not. He kept his gaze firmly in the opposite direction until I asked that the tab stay open. I was not sure if the charge would go through. “I always say,” said Manish, continuing the thread of some conversation that could have been unfolding for some time, “the last safe place for crooks is India. All of you in America are living on borrowed time.” I did not respond. I had played out the India versus America debate so many times in my mind that I had prevented myself from ever reaching an opinion on the topic. They were both dead ends: that is, places in which you could die if you wanted to. The only difference was that the crooks of one place felt familiar in a way that the other would not, no matter how many elections I voted in or Costco memberships I renewed. I rubbed my palm against my face thoughtfully to avoid having to say anything. “Why did you come, then?” Manish asked. “How is Natasha?” From somewhere in his pocket he found a toothpick and took it to his teeth, where he winced and continued to hit a particularly sore region of gum. There was something about it all that endeared him to me, my old friend shading his mouth out of propriety. I felt his bulk, his comfort, his direct questions as a warmth particular to that side of the world. In Bombay every friendship was scintillated by exchanges of information about other people. I did not want to be the wind that blew my own bad news to another man’s ringing telephone. “Vacation, brother,” I said. “Look at this liar!” His flat palm clapped suddenly at my cheek. “You do not have to do all this drama, buddy,” he said. “Everyone has heard.” I laughed by accident. I had been drinking since ten that morning. “Now, listen,” he said. “Listening.” “Are you listening?” I nodded. He leaned in close as if to say something religious. “Move back,” he said, his palm slapping the table for emphasis. “All your friends are here. You can live in your parents’ old flat, no? I was sorry about your mom’s passing, man. But I am sure the old houseboy will even come back to work for you. What was his name? Chintu? Good fellow. Loyal. Tell me, is it true the apartment is just sitting empty, because if you do not intend to sell it off, I will happily look into it for you. “Are you listening?” he asked again. “Listening,” I said. Natasha appeared once more in my vision, that neat trick of marriage, and I looked instinctively at my thigh, knowing how she would commit some violence to my leg under the table if she were here. She never liked Manish. “Listen now. Divorce rates are going up here too—every Tom, Dick, and Harry is getting divorced,” he said. “Lots of single women.” “We are not getting divorced,” I said. “Buddy, I heard that she did not even let you come back for your mother’s funeral. Is that true? You missed your own mother’s funeral because of her?” He was speaking very loudly, and I was struck with that old gift of defense I knew so well as a young man. I explained that my oldest daughter had been going through a hard time at school. Natasha had been on the night shift for three months. There were things I needed to take care of at home. I could not have left. “You are not listening,” he said. “Your chains have been loosened. You are free. I tell you, we were lunatics to get married so young.” I stood up slowly, gesturing to my desire for another drink. The glasses at The Polo Bar were so small. It was a complaint I had heard from my father’s mouth as a child. He was right. Was he always right? Another? I asked Manish with my eyes. I did not mention that I had thought up a plan to deal with my unobliging card. I would keep the tab open, let the card hit the limit, then call the bank in the morning to report the entire transaction as fraud. My wallet was stolen, I would say. Manish gazed into his crystal affectionately. “You know what,” he shouted as I was halfway to the bar. “Why not?” Elbows on the counter, I was caught by the arabesque of liquor bottles that made up the far wall of the bar. They reflected the soft overhead light, shades of toffee and chartreuse, twinkling like they were in conversation with one another. To my left and right people were talking. I held the noise of their moving voices as a weight in my ears. Yes, I was suspended somewhere in the black-orange light. A man in limbo, a man with no country. I heard myself order our drinks with the transcontinental twang I usually saved for call centers and air hostesses. I was a man of here, living there. A man of there, visiting here. I wanted everyone to know it: I was a stranger, a guest, an apparition, a man on parole. It was my first time back in ten years and even then, I knew that The Polo Bar would not see my face again for another twenty. I imagined that I would go back to my wife with a fresh beam of light in my eyes. I would swing her leg over my hip. In truth, we had talked about divorce. Some months before my trip, she had poured my last bottle of Stoli down the kitchen sink and I, delirious, childishly hopeful about our situation, spat in her face. It was my fifty-third birthday, and we were back from a party at the neighbor’s. She had worn a velvet dress with red stitching that went to her calves. All evening she was a kind of beautiful dragonfly, passing from group to group with the flutter of one who is liked by people and knows it, swinging out the cake, clapping with her long, almond fingernails. In our own home hours later, she was swinging a knife, screaming into the belly of our hallway that she wanted to stab me. We talked to each other that way sometimes. I did not mind. She came to bed later complaining about the bananas. They were ripening too fast in the heat. The first sunny days of spring. A hatch of small flies were disguising themselves in the spotted peels. You could not see them until you touched the bananas, and then they would fly up in a panic. It was disgusting, she said. She had to throw them all out. We could just live without. I felt the tragedy of this exchange as if she were talking about a child of ours. From the bar I watched the door swing open for a woman in black. She moved like a bride, watchful, her destination clear to herself and those who looked up to watch her. She wore a sleek satin top that fell into folds at her chest, hiding any cleavage, but revealing a set of collarbones strong as branches. There was some hubbub further down the bar where a bearded man had spilled a red drink across his beige trousers. He angrily patted at his crotch with a napkin, emptying his embarrassment on the bartender, who observed from the other side of the counter apologetically. When I looked for the woman again, her jewel-studded hand with its darkly painted fingernails appeared at the back of Manish’s neck, where it pinched the skin lightly. I started to walk over to the table when it occurred to me that it was bad manners not to bring her a drink. I set Manish’s glass down in front of her, knowing he would understand. Her fingers wrapped around the crystal easily. For this, I could tell that she was a woman who knew bad luck. She sipped without making a face. Manish and I looked around the room while she drank, hiding our wonder. As I sipped my own drink, I had a perfect understanding of their romance. He loved her more than she loved him, this woman who was not his wife. I felt a palpable and fast camaraderie with the pair. We were three fools who had failed at marriage. “I would like to play a card game,” I heard myself tell them, a skewered olive bursting bitterly on my tongue. I do not know where my memory goes from there. I see now Manish’s greenish jowls, moving to call my ear to his mouth, instructing me to stick out my tongue with that low whisper he reserved, even in our school days, for shenanigans. There was a blank sensation on my tongue, left there by the tap of his finger. But he could not have given me the tab in the open like that. It would have happened in a bathroom stall or some dark alley. Still, I see us both laughing, gripping each other’s arms in anticipation of the fun we were about to get into, those large fans still above us in the high crescent of my eyeline. I see the woman in black shaking her head disapprovingly, but with that familiar sly smile of amusement that I had seen before on my wife’s face, when our daughters pushed each other around. Then we were all in a rickshaw, headed past Marine Drive, past the Flora Fountain, past a woman wrapped in red fabric sweeping rubbish off her stoop with a broom. She looked calmly at our passing vehicle before adjusting her sari and continuing to sweep. The little car ricketed as though we were traveling over cobblestone. It might even have been the case, some old stone from the nineteenth century. I did not recall looking down to check, but it was not difficult to picture the jackals or even to hear them chirping from a time when much of the city was still an overgrown jungle. I pictured phantom birds, wild things, flowers opening their sugary petals, and then marigold garlands, which were real, drooping from the rain around framed pictures of dead relatives, pictures of goddesses, nailed into arbitrary walls and left for a morning visit. We approached a graying construction with gothic arches and a red, central dome. Something that looked as though it had been clipped and pasted out of a fading European postcard, its stone exterior stolid and bourgeois. The road dipped surreptitiously into a back alley and without warning we were underground. I got a whiff of patchouli and amber, which escaped from the cold wind of the oak door as it opened and closed for other guests. Behind the door was a blank room with a crystal chandelier and intricate paneling, empty aside from a wood desk with a clipboard and a pen. Hearing our noise, two security guards in what seemed to be bulletproof vests stepped in front of us, both of them chewing what I assumed to be paan from the reddish stains on the outer wall. Roughly, they asked Manish what he was looking for. I could hear the steady vibration of Western music coming from further inside. Manish pulled out a card from his wallet to show his membership, which satisfied the two guards. They vetted us by patting our backs, stopping at Manish’s girlfriend, Sonali. “Sir, this is a gentleman’s club,” said one of the guards. Manish made a show of digging inside his pocket for something and tucked a few notes into the man’s vest. “They make you carry weapons and all?” Manish joked to smooth over his bribe. “This is not an airport, bhai. No terrorists coming here.” By a single touch of his chest the guard could tell how much money Manish had given him. He shot a neutral look at the other guard, whose expression seemed to encourage more haggling. Following a quick dart of whispers between themselves in a dialect I could not identify, they moved aside to let Sonali pass. Manish led us through a dim hallway where all the light was kept out by a thick, burgundy curtain. In the inner room, cheap purple lights twinkled where the ceiling met the walls. There were two makeshift stages with poles and plush chairs around the periphery. A tall woman came to greet us, her palms joined together in a casual namaste. It was only when I heard the gruff bubble of Manish’s laughter that I realized the woman was nearly naked. From the waist down she wore a traditional sari with a thigh-high opening from where a bronzed leg would protrude each time she took a step forward. To cover her breasts she wore a jeweled bra. Her skin appeared lacquered, and it glowed an electric blue under the light. “Some goddess,” Sonali whispered to me. The woman led Manish to a chair in the room, in front of a pole that she prepared to use by undressing from the waist down. Underneath her sari, she wore a gold thong, the strings of which she checked for tightness. There were two other men inside, a father-son duo. Once we were seated, they raised their glasses to us, and Manish called out to them with his usual masculine warmth. “Kesai ho, bhai?” The father nodded his head to indicate that he was doing well and invited over a member of the waitstaff. Relieved, I thought I heard him order us a round. His son looked nauseous, either at our presence or his own. He sported a fresh pubescent mustache and a Yankees T-shirt, both of which he fussed with incessantly. Sweating bottles of Kingfisher appeared beside each of us. Looking up, I saw a young woman in a bindi and glasses holding an empty tray. She was dressed in a white shirt and a black vest, though I remember thinking she looked young enough to wear a school uniform. I had the urge to ask how she got caught up in this world. From what I knew of Bombay, you could ask people things like that and they would tell you. They would inch out torn photographs from the folds of their clothing as an explanation, usually a child or a sick mother in some far-off village. I wanted to ask but I was beginning to feel exhausted from our journey. For a moment, I could not remember if I had left my car at The Polo Bar and if I had, as I suspected, forgotten where I parked, I needed to find it at some point. We thanked the man across the room for our drinks. He raised one palm in our direction as a parting greeting. It occurred to me then that he wanted us to continue to exist in the room in our disjointed worlds. The drinks were a promise of that—his own privacy. Time began to disappear, replaced by waves of wanting and unwanting. Wants: a pressure at my lips, my wife’s sleeping body in its curled shape beside me. In my mind I began a conversation with her. I told her that I knew what my problem was, that I had been too happy as a child and had lived my entire adulthood trying to recapture that rapture. And was I sorry for what I did? she would ask. Yes, I was sorry. As the finale of our arguments, she would often assert that I did not consider our family my real family. “You think your real life is still in India,” she would say. I knew that she did not speak the truth to help me see myself clearly. She told the truth to hurt me, to humiliate me in front of our children. This was the dance of our marriage, and so I would put out a hand for the waltz. “This is not a home,” I said to her during one of these fights. “This is temporary for all of us.” The fizz of beer rose in my mouth; in it, I tasted the black tongue of our arguments. On the other makeshift stage, where the boy and his father were sitting, a shining, lilac woman crawled around the floor. At our stage, the gold woman’s eyes became a clothesline connecting to Manish. I figured she could tell he was the only one among us with money. I thought about the exchange rate, if Manish was putting exactly seventy-four rupees between the string and her skin. “I heard you are getting bored,” Sonali said to me. I motioned for her to repeat herself into my ear. The speaker vibrations overpowered the melody of whatever song was playing. “I heard you are getting divorced.” I told her that I was still married, that I intended to stay that way. “Me too,” she smiled, her breath gingery and bright. She turned the diamond around from the inside of her palm and presented her left hand to me. It was a modest ring, an old-fashioned band. The setting had been popular in the nineties, thick gold with a smattering of small diamonds. My father had specialized in it back when his shop was still open: The Bridal Set. The bestseller, the winner, the one that paid the bills. When my father sold his first, we celebrated with a duty-free bottle of Moet & Chandon. I was not much of a joker, never the funny guy, but I instinctively jabbed Manish in the arm. “Congratulations, yaar,” I said. “You could not buy her a better ring? This design is thirty years old.” Manish dismissed my comment with a sharp shake of his head; he was focused on some trick the woman in gold was performing with a lollipop. Sonali put a hand on my chin. For some reason I felt that I was the one who was undressed. “Not him!” she said. “I am married to Rohit Shetty.” “The real estate guy?” She nodded. “Is not he in jail?” She looked down at her hands, her ring shining like a berry. I knew jail, I wanted to say. When you are at the bottom you come to know all the dark places that you thought were only for other people. In fact they are for everyone. They welcome you. You are in them before you know it. But it was not the time to talk about myself. I felt Manish’s eyes on us and when I turned to face him he took one of Sonali’s cheeks between his thumb and index finger. He kissed her with a splotch on the mouth. I pretended to be engrossed by the woman on the pole, knowing I would not get aroused with a teenage boy in my eyeline. I watched his hand flutter to the lobe of his ear, his gaze zip between his crotch and his father, parsing out the correct behavior for a situation like this. I thought then that maybe we did not like ourselves very much. I tried to catch the boy’s eye so we could share something, some wave of discomfort, a shrug, and that was when Manish stood up and walked to the front of the stage. With a curled finger, he called the woman from her high place on the pole. She faced away from Manish and bent down so that she was on her hands and knees. He raised his hand to touch her, but a man’s voice erupted from the back room. “No touching!” It was the security guard from earlier. He approached the stage with a baton in hand. “No touching?” Sonali and I watched as Manish grabbed the woman with his right hand. She let out a shriek and it felt like a glass prism had shattered somewhere in the room. The guards rushed over to Manish and held his two limbs apart as he struggled against them. They waited for the woman in gold to have her revenge: she caught Manish by the collar and channeled her twenty-something years into a gorgeous, crystalline glob of spit. They hit him once to stop him from struggling and I, with my misplaced righteousness, stood up to help my friend. For several minutes they were on both of us, and we ended up on the ground, fighting, audibly cursing each other for our stupidity. Once the commotion flatlined, a high whistle began to sound in my ear. Or maybe it did not happen like that. Maybe it was something else that bruised my ribs. But I remembered the woman’s voice, calling the guard by his first name for help. Ashwin, Ashwinder, one of those godly names. Manish’s lower lip had swollen into a fig and Sonali kept her gaze fixed outside the window of our cab. The shifting navy screen of nighttime, copper and crystal lights. Manish asked her to take a look at his mouth. He held it to her eyes, a chubby finger pointing at the damage. “You act like a donkey, you are going to get treated like one,” she said. There was a lull, sounds of traffic, a series of gated apartment buildings. I felt the faint pulsing of blood in my ear, though I was too afraid to touch it, in case I was left with a profile of mangled flesh. “Now we do what he wants to do,” Manish said. It was an instruction to the cab driver, who turned around and looked at me. I was humming an old Bollywood love song that my mother would often sing after dinner, when she took a knife to the spotted skin of a pear for our dessert. I aimed my humming at Sonali, who knew the tune immediately. O heart, take me to the alleys, The streams of love, I have gotten lost, Looking at the moon, Waiting for her to come back. We sang together in the backseat of the cab and a silver thrill flashed and disappeared between us. I heard myself guiding the driver about where to go with Manish’s interjections. When we arrived, twin gates swung open to let us in. A security guard in a blue uniform, delight across his face, walked us into the marble foyer, past a placard the size of a billboard listing last names and apartment numbers. We were headed to 5A and everyone seemed to know, though no one had to say it. The elderly elevator attendant called me by my name. “Well,” he said to Sonali in Hindi, “they are men now. I have been here since they were this small.” His flat palm shot down to his waist for a visual representation. We all breathed loudly, the lobes of our ears red. The apartment door was open, or at least I did not remember hearing a click at the keyhole. I could not tell you how many people were present, how many of them rushed to the door to greet us, making a commotion of our chests and cheeks with their hands. I could not tell you if it was real. But I remember that I was presented with a toffee-colored dachshund who yapped into my hair. Manish switched on lights that glowed from the two baby chandeliers, illuminating a room heavy with the thick, hot haze of men drinking. I saw that there were two tables set up: one for food and one for a game of cards. I pulled out a chair at the first table, settling the dog in my lap, and found myself face to face with an uninspiring cucumber salad. Beside me there seemed to be an old woman counting cash. She looked up with indifference and I thought it was strange how closely she resembled my mother. She was dressed in a Victorian nightgown, her long gray hair in a thin braid that hung by her waist. I knew the texture of her at once: the straw hair, the pilly cloth, the perfect white crescents of her fingernails. I wanted to hear her voice. I asked her what was in the salad. “Arré Chintu!” she yelled into the sky. “Inside salad, what is?” An irritated young man scurried from the kitchen, his hands wet from the still-running tap. In English, he began reciting the ingredients, counting them off on his fingers: “Cucumber, mint, pear, apple, honey, watermelon.” “It is a fruit salad,” the woman clarified matter-of-factly. “Please eat. All day you have not eaten.” I watched her fingers swipe bill after bill, the freckles of old age dusted across her arms. Surely it was my mother, dead now for over a year. I nodded at her to seem calm and wondered how long I could continue to sit there without somebody asking me to introduce myself. From inside the kitchen, Manish brought me a glass of something pink, a sweet foam nearly running off the brim. “It is really hitting me now,” he said. I remembered then that we had taken something before we left The Polo Bar. Its consequences were concentrated in my eyeballs. Across the room, chairs scraped the floors pink as the poker table was set up. The salad was plump, squealing things I could not understand. I remembered feeling a deep sadness that everything in the world was not painted green, the best color. I hungered for green. The gift of sunlight flecked on leaves, the pale chartreuse of American money. People kept patting me on the back, saying that it was good to see me. “Good to see you, Tiger,” they said. Some of them had long, naughty anecdotes from when we were in school together. Me, the backbencher, bribing lecture proctors to count me as present when I was anything but. What was I even doing? No one knew. I would just disappear, they said; it was a miracle I ever graduated. I asked whose house we were in, but even at this they laughed. I thought the dachshund laughed at me too, but she had only raised her small skull to observe the noise before letting it settle again on her front paws. I felt unwelcome, annoyed that everyone behaved as if they knew something I did not. I looked at the old woman with a blank face, like I was in on the joke, and she smiled back at me warmly. “Eat something,” she urged again. She pushed a plate towards me, thumped a helping of salad on its side. It was usually impossible to negotiate with women like her—benevolent party ghosts who force-fed guests until they begged for peace. There was one of them in every old apartment. I complimented the food after my first bite and removed myself from her reach. On the far end of the room, Sonali was running a hand over the woodwork on one of the cabinets. I had watched a YouTube documentary about her husband’s arrest. The courts were auctioning off their various properties: the Dubai villa, the Alibaug farmhouse, the Bandra bungalow. She saw me see her, and a thought we shared told me that she was remembering the house she once lived in. I imagined it to be eclectic but classic, like her, something with many unsuspecting antiques mixed with modern pieces, good art, chestnut floors. I could tell from the envy with which she eyed those old cabinets that the sadness she carried was new. I took the dog to her as a silent offering but she recoiled at the sight of its tongue, afraid. She was never one for small creatures, she explained, ordering me to take it away. Standing next to her, I became aware that I was newly damp between my legs. My first thought was menstrual blood, but then I remembered that that could not be. I took the dog with me to the closest bathroom, a dark, high-ceilinged space with a black toilet. For several moments as I undid the buttons of my jeans, I considered the possibility that my body was changing, that I was being sucked into a deep, emerald hell. I held onto the wall, frightened, certain that I would not be strong enough to withstand any sort of karmic wind. The oculus in the ceiling appeared to open briefly and I felt tremendous shame standing there as the universe opened up before me in my underwear. I shook myself dry and took the dachshund to my breast. The pictures on the wall were in shades of sepia and gray, posed photographs of a young woman, her bouffant stiff as a lampshade, holding a bundle of cloth to her neck. A baby. In another photo, a man with a furrowed brow carried the child, older then, on his shoulders. I was looking at the pictures when Sonali came in. “Princess!” she said to the dog, refusing to hold her again. I showed her what I saw, expecting her to provide me with some history. Her hand was on my back. She asked if I knew that the lady’s husband died in a terrible accident some years before. He had drowned. “Drowned?” I asked. “He was a drunk,” Sonali said. “He tried to go swimming.” She leaned against the sink, produced a cigarette from somewhere in her pants, and brought a flame to her face with the nonchalance of an old habit. A velvety puff of smoke surrounded us. I let the dachshund out. Wanting to fill the silence, I asked Sonali to tell me something surprising. She said there was another man in the picture, a man other than Manish, other than her husband. He lived in London. I thought, wow. It was my turn and I shared that I had kissed a man once, during a dry phase of much rejection from both employers and women. I was twenty-one, newly anointed with a bachelor’s degree in management science, though I was not ready to manage anything yet. And did I enjoy it? she asked. I confessed that I did, though I did not know it myself for some time. Unprompted, Sonali began to talk about her husband. She said it was an open relationship now, that she was not doing anything wrong. “Rohit always had his whores,” she said. I wanted her to say more but I knew that anything she said would depress me. Talking about other couples was always a dangerous game; either they made you think you could have done better for yourself, found someone as good for you as they were for each other, or that you could have been better for your wife, which was always true. But she still loved him, she admitted. She believed he was innocent. “I do not think he is,” I said. “He was convicted.” Then she stopped talking. We listened together to the insects outside, who said things we could not understand. I could hear them in color: brilliant pinks and oranges, chirping, chatting out in the wind. I knew I was hallucinating only when I began to hear a sitar track the melody of the song we were singing earlier. Sonali looked at me like she understood what was happening, like she heard it too. “Relax,” she said. There was her hand again, making a generous circle on my back. I wanted to put my arm around her, this firestarting woman. I let her kiss me, let her guide my hand to her thin, silky underthings, then down, down, where her legs were parted slightly in anticipation. Kissing her was extraordinarily loud, like moving furniture. I had the instinct to swallow her whole. I looked into the great glistening mound of her, the reddened mouth, the spidery lashes, the hint of an Adam’s apple. The growing redness of her inner thigh, where my belt had hit up against some thin but strong bone. I was grateful. I had not touched a woman other than my wife in twenty-seven years. She moaned so sweetly in my ear that I heard it as a chord. I had another drink. I felt I had some business to complete at the pool. I knew where the pool would be from the way the bodies in the apartment craned their white necks out and down from the balcony. I took the stairs to the ground floor, expected and received a whiff of Dettol past the changing rooms. I cannot explain how I knew it would be there, that black rectangle of stillwater, shining under the moonlight like a sheet of metal. I took off a shoe and threw it in to make sure it was all real. It was. The splash untied some taut ribbon deep in my abdomen and before I could think, I had taken one step and then another, laughing at myself. The water was warm. Tenderly, it pulled me in, set alight a coolness in my scalp. In the center of the glowing orange square of the fifth floor, I watched Sonali’s body waver with the dachshund in her arms. I knew that she recognized me from her great height, and I wanted to return the comfort. I waved to her: an invitation. There was the sound of thunder from somewhere far away. Would it rain? At first I felt fear for the weather, for the gossip, for the state of my marriage, but beneath it, growing, I sensed the spread of a stony new calm. I had an ancient impulse that knew this building, knew this water. I knew I had seen it all before as a child. I had jumped off the diving board. I had touched the bottom tile. I swam out to the middle of the pool and dove under. The string of an old memory came to me, but I could not catch it. In the deep, the water was colder. It separated me from myself, dulled the crescents of my fingertips. I imagined that I was all gone, one with the black. There was no skin, no cloth that made me different from this, the dark. I thought I saw a glint of something silver float close to my face and flicker away. It looked like the long, gray hairs of an old woman. I put my hands out for her to come again but she did not. Above water, the thunder sounded again. It belted gently, muffled like words from another language. The salt of hot tears ringed my eyes. Not even our memories came back when we wanted them to. I felt a rising froth of longing for my mother and then hands, pulling me up, quick, by the collar.",
    "Moving,Pictures": "Spring, 1919 Soon, she will leave. But now, she is tired. As the oldest daughter, the only daughter, she has spent years carrying her brothers on her back. She is seventeen. Her spine is already crooked. Before she was born, her father named her Yamul, literally adept, nimble and competent, like a prophecy or an expectation. She is not sorry to leave him behind. She is not sorry to leave Yamul behind, the name and the expectation, the laundry and the dishes. She will leave behind the house and the men, her father and her brothers, bothersome and bottomless, always breaking, always helpless, always opening their arms to be held, always opening their mouths to be fed. In the morning, her father tries to stop her. He rushes to the shipyard after he wakes up to a house that smells empty – no kimchee, no tea. He drags along two clumsy-fingered brothers. But he is too late. All three stand at the pier by the barge. She is already standing on the ship’s wooden deck. They look up at her and she looks down at them. The men seem small. “Yamul, we love you,” her father says. “Come home.” She just grins, white teeth, lipstick. That afternoon, she watches the green land quietly collapse, shrivel, until she is surrounded by blue crinkled ocean and everything she knows is gone. She imagines she is leaving herself, too, leaving Yamul, the obedient, adept daughter. She is someone new now, a woman reborn in the middle of the Pacific Ocean. The trip from Korea to Hawaii takes weeks. She soon meets her bunkmate, a frail sixteen-year-old. Each night her bunkmate gets sick all over the floor, drunk on the ship’s rocking. The beds are wooden here, cold, and the rice is never cooked properly. She is stranded in the middle of an unending ocean, one stretches blue and blank into the sky, and the journey is beginning to feel long. Thirteen days into the voyage, her bunkmate shows her pictures. A man stands in black-and-white, a little blurry. “He is so handsome,” her bunkmate says reverently. “Yes,” she agrees. “He has a Rolls Royce,” her bunkmate says. She turns. “And what about yours, then? Handsome too?” Yamul has two pictures of her future husband. In one, he is standing by a car, black, expensive. In the other, he is standing by a house, white, also expensive. He is attractive, maybe twenty or twenty-one years old, too much hair. Later, history textbooks will mention her in their margins. The textbooks will call her a picture bride, because she is crossing an ocean to marry a man who she has only seen in photographs. She knows her husband’s name, and she knows he works in the sugarcane plantations. And she knows that if she had stayed in Korea, she would have been married off by her father. This man she chose herself, all on her own, isolated, and she could have even refused him. She had seen him, him with his hair, car, crooked grin, and she had decided that she was in love. She had sent back two of her own photos, one with her hair tied up prettily and one where she stood in a white slip. “Yes,” she says. She grins. “He is handsome.” Summer, 1919 Her first taste of America is a vagueness in the distance. The young women go above deck to watch the land take shape. It comes grey and humid. They dock, anchor. The stillness of the boat unnerves her. She is hurried off the ship, together with the other brides. The women are hustled into a building. One by one, they step up to an upright white box and a man instructs them to sign a marriage license. They each have one – one per bride. When it is her turn, she signs, and then the man places one lukewarm hand atop hers to get her attention. He points to the door. She walks outside. She is an American now, a married bride. This is her wedding day, and it is time to meet her husband. The brides walk to meet their grooms. Someone taps her on her shoulder. She turns and sees a man. He says something to her. “No English,” she says brokenly. “You undersold yourself,” he says in Korean. He is middle-aged. He is balding. “I do not understand,” she says. “You are beautiful,” he says. “You are more beautiful than the photos.” Then he smiles crookedly, and she suddenly understands that this man is supposed to be her husband. She is shocked. He looks more like her father than he looks like the man in the photograph. She looks at him, his plain old face, his plain old suit. He must be twenty years older than her. She feels sick. She feels cheated. This is not the man she loves. Later, the history textbooks that call her a picture bride will say, the men lied in the photos. They will say, the men were desperately poor. The picture bridegrooms posed with rich friends’ cars or sent photographs from thirty years ago. In reality they are bald. In reality they are in debt. Marooned, the brides, locked to these old, broke, lying men, will be forced to work the plantations until their hands break and bleed. Soon enough, this whole textbook future will unfold beneath her like prophecy, like paper. But she does not know it. All she knows is that the boat has already left. The man takes her to his house. It is squashed, cabbage-colored. They are beside the plantations, dry fields that stretch like tangled hair. He fumbles with the key. He opens the door. “Okay,” he says. “Welcome home.” She walks inside and surveys the small space quietly. There is a single bed. There is a sink, a toilet, a kettle. She feels a hand on her back. She looks up and her husband pushes her towards the bed. She falls quietly onto the covers and stares at the ceiling. He begins to kiss her. He is not a good kisser. There is too much wet. He is a little fat under his suit, too. And she can feel how much he wants her. She is young, beautiful, red-lipped. He has been in this vacant place with no women for too long, all alone, and he needs a woman to love him. After a few minutes, he pulls away, reluctant. “You are so pretty,” he says. “Yamul.” She is shocked. She opens her eyes, sees white wall. “You know my name,” she says. “Well, yeah,” he says. “How do you know my name?” she asks. Her husband looks at her like she is a strange and foreign creature, something to handle cautiously. “You know my name too,” he says. “Do not you?” She falls quiet now, feeling stupid, because she does know his name, and it seems only logical that he might know hers as well. Still, though, this somehow feels like the ultimate betrayal, him knowing her in all her daughterhood and adeptness. She had crossed an ocean to escape its prickly, inevitable grasp. And now here he is, her husband, pudgy, ugly, desperate, with no hair, with too many teeth. He will ask her for food, he will ask to be held. She will need to clean this house. Even in America, she is only Yamul. Fall, 1919 They have fallen in debt to the plantation store. They have fallen in debt to the neighbors. Her husband is a gambler and an addict, which disgusts her, but then again all the men are. It is expensive, the alcohol, the opium. She has to protect what little money she has left. Her name is still Yamul, and she still does not speak English. Today she wakes up at night, dark everywhere, and she changes into crisp clothing, the fabric stiff from too many washings. She labors in the sugarcane plantations, alongside her husband, both of them on the owners’ clock. The day is made of knuckles and it passes in tangled, swollen hours. She keeps her head to the dirt and she works adeptly, competently. She has no other choice. When she gets home her hands are tacky. She licks one palm, experimental, and she tastes sweat, sugar, blood. She cooks dinner, rice and pork, cheap and hot. She and her husband eat quietly, quickly, chopsticks always halfway to their mouths. Afterwards her husband steps back from the table and presses into her, soft. She let us him do it. They fall onto the bed. They have had sex twice in their marriage, both times awkward. Now he hovers over her in the dark. She goes very still, almost stiff. “Relax,” he breathes into her ear. “Just relax already.” “I am relaxed,” she says. “No, you are not,” he says. Everywhere around them is dark. She is worn-out, tired. She has worked all day. She turns slowly around, so that they face each other, knee bones clicking together. His eyes are wide and black in the dark. “I cannot do it, Yamul,” he says. “You know that. I cannot do it until you are relaxed.” “I do not understand,” she says. “I am relaxed.” But she does not move or unclench. She just looks at him with big, innocent eyes and waits. With one fist he hits the thin comforter. He groans, his big body softening under him. He is like a child. “You are turning me off,” he whines. “I am sorry,” she says. “Every night,” he says. “Every night, you sit there, so still. You think I do not know what you are trying to do?” “I am confused,” she says. He looks at her, still halfway lustful. “I am your husband,” he spits. “Do you know that? I am your husband.” Back in Korea, her father liked to say that love is something that emerges between a husband and his wife after they are married. Love, in her father’s mind, is just another expectation. And she is Yamul, adept. She has grown accustomed to providing men with expected things. She cooks rice and sweeps floors and leaves the fields with hands stained with blood. She opens her arms to her husband. She feeds him. But he is not the man in the photograph. She does not feel love. Winter, 1919 On an October night, her husband gambles and fails. He comes home insecure, needy, drunk. He staggers into the house, shuts the door, fiddles with the lock. It is two or three of the clock in the morning. She is already in bed. He comes and lays down next to her. “Yamul,” he says, cotton mouth breath. “You are awake, are not you.” “Yes,” she says quietly. She hears him sigh. Drunkenly he reaches out a hand, too warm. He strokes down her arm tenderly, feeling its fine hairs, caressing the soft envelope of her elbow. She wonders momentarily if he is trying to ask for sex. But he does not move past her arm. For five minutes they stay like this, breathing together, him stroking her. Then she finally turns to face him. “What are you doing?” she asks. “Do you want me to stop?” he asks. He studies her. She does not say anything. “Okay,” he says. “I will stop.” Now he pulls his hands away. He turns from her, so that he lays on his back. He looks up at the white ceiling. She glances at his face. “What is going on with you,” she says. “You are acting strange.” “I am sorry,” he says. “I do not know. I am sorry.” She is quiet now. In seven months of rotten, miserable marriage, she has never heard him apologize before. She stares at her husband like he has become a foreign person. He is still staring up at the ceiling. Slowly she notices that his eyes are wet. He is almost crying. She notices this dispassionately. Maybe he is upset about the gambling, maybe he is just too drunk. Maybe it is something else. She finds that she does not particularly care. “I am so in love with you,” he says, sudden and unexpected. “I am so in love, Yamul.” She pauses. She does not know how to respond. She does not understand how he could have grown to love her when she feels nothing but coldness towards him. He turns to her. He is crying now, fully crying, and it looks terrible. Tears dribble from his eyes onto his cheeks. His nose is running. She leans away. “God, why do not you love me,” he says, helpless, fishlike. “I am your husband. Shit, you are supposed to love me.” She is silent. Slowly he begins to calm himself down. He settles into the covers and sniffs wetly. “Come here,” he says. “Please.” He opens his fat arms to be held. And this is something she has done before, this is something she knows. She does it quickly, competently. When she reaches him he grasps onto her, sloppy, too tight. He winds his arms around her and rocks her body drunkenly. She let us it happen out of obligation alone. She does not complain. She listens as his breath slows. Eventually he tires, and he let us go of her, and they both fall back into the bed. Tonight her husband is melancholic, depressed. Tomorrow she will wake up and find that he has lost more of their money. They will not have enough to buy pork for dinner. She will serve rice in chipped bowls. Soon, she knows, too soon, he will run out of things to gamble. Spring, 1920 It is a Saturday evening when they finally lose the last of their money. They are at the neighbors’ place, a party. The husbands are drinking, gambling. The wives sit on the couch like porcelain. Cards lay scattered across the table. The men are on the second or third round of their game, but her husband has lost every hand. Her husband empties his pockets of pennies. The other men take the coins, slipping them into fat pockets. “You out yet?” one of the men asks her husband drunkenly, in Korean. “No, no,” her husband says. “Not yet.” “Well, what do you want to bet then?” the man asks. “If you have even got anything left.” Her husband looks down at the table. He splays his fingers, touches the edge of a playing card. He glances up at her. He grins. “Her,” he says. “Your wife?” the other man snorts. “Yeah,” he says. He nods to her. He grins wider. “C’mere, Yamul. Stand up.” She is sitting at the couch, the other women beside her. Quiet. Her knees pressed together. Palms on her thighs. She looks up at her husband, still and silent. He looks back at her with black, glassy eyes. “Pretty, is not she?” her husband says. “Play your cards right, and maybe you can win her love.” The men laugh. It is a joke. They leave quickly. Outside, it is raining. Her husband is drunk out of his mind. As they walk back home, she feels fat raindrops slide from her hair to her cheeks. Soon they are both drenched. They make their way to their porch and begin to climb up the stairs. Before he opens the door, her husband pauses. He turns towards her. He brings one hand up to her face, cups her chin, and she looks back at him, hollow. For a minute they both stand there in the deluge, rain everywhere, his drunken breath five and a half inches from her throat. “God,” he says casually. “Thank God I did not actually lose you, huh?” Now he steps closer. He presses his lips into hers. She feels empty. She does not resist. They kiss for thirty-eight seconds. She counts them, wet heartbeats. He pulls away. He grins. “I love you,” he says. Her father said this too. Her husband pauses. He studies her, then pats her cheek. “Aw, you are mad,” he chuckles. “Do not be mad. It was a joke.” “I am not mad,” she says coldly. “It was a joke,” he says. She looks up at her husband, and then she looks through him. For a moment she thinks about running away. But she knows that she will not. This story already has an ending. Her story has had an ending before she was even born. She stands alone in the rain. Her husband is next to her. Or maybe he is not. Maybe she is not even here. Maybe she is still in Korea. Maybe she never even left. Her husband grabs her arm. She looks into his fat eyes. He has been talking. She has no idea what he has been saying. “Wait, actually, are you mad?” he asks. “Yamul. I am sorry. Are you mad?” Later, the textbooks will call her a picture bride. The text will say, she could not leave. Then the paragraph will break, and the textbooks will not say anything else. They will not explain why she cannot leave. It is because these small technicalities, every whisper and rule and name that constrains her, do not warrant the space. There are more compelling and more important things for men to remember. She will only exist for a quarter of a margin. In some textbooks, she will not exist at all. She has spent her life existing in spaces that are too small for her. She is not the first woman tangled in the prophecies of men. But in the dark with her forlorn husband, she only finds herself smiling. She is grinning now. She is grinning because she has won. Men, husbands, fathers, brothers, reach to her helplessly, always broken, always hungry, always desperate for rice and love. She will feed them. But she will never love them. Yamul feels the rainwater fill her mouth. She imagines it is ocean on her tongue.",
    "LosAngelesBarCrawl": "1. He begins in a bar in Santa Monica in the early evening, a gastropub that serves burgers and beer, though he only has beer, first a lager from a local brewery that he finds a little too light and fruity and then a pale ale modeled on something from England, which has a nice caramel bitterness that leaves him feeling pleasantly at ease, as if he will sink into the cushion on his seat and get swallowed up by the soft fabric. On the patio across from him, facing the street and illuminated by the passing headlights, sit three guys about ten years younger than him, somewhere in their early twenties, talking excitedly and laughing wildly and slapping each other on the back, a field of empty glasses spread out on the table between them. They make Ahmed think of his own friends from college, how they used to go to bars like this one, the effortlessness of conversation, walking home afterwards and feeling as if life would always be this way. He finishes his last beer in one long bitter swig and then signals the waitress for the check. Above him, the sky is turning red with the sinking sun. 2. Next, he takes the metro all the way downtown, deciding on a whim to go to a brewery in the Arts District where he used to go all the time when he lived on that side of the city. It is a large space in a converted warehouse, and by the time he arrives the sun has set, and the red brick building looks striking against the dark sky, the neon sign making him feel a jolt in his chest, reminding him of days years ago now, when he and Amy would come here and sit in a corner booth for hours, talking and laughing with the easy banter of a new relationship, then stumble out, hand in hand, kissing in the warm night as they waited at street corners for the light to change or in the doorways of office buildings, their bodies pressed against the dark glass. But now, when he goes inside, he feels a strange loneliness. The bar is crowded, and he has trouble signaling the waiter, and when he finally orders, his earlier buzz is gone, and he feels a headache coming on from the back of his neck. He drinks his beer quickly while standing at the bar, an IPA that he finds a little too strong. Afterwards he orders a Belgian sour and sips it slowly while checking his phone, feeling self conscious that he is the only person here by himself and trying not to stare at the couple across the bar, both of them older than he is but gazing into each other’s eyes with a passion that he has not felt for a long, long time. On his phone, he pulls up the email he sent earlier to the tutoring company where he worked, subject line “Two Weeks Notice.” He would asked them to raise his pay rate but they would refused, citing budgetary issues. It is a tough economic time. We all have to make sacrifices. In a rage, he would quit, sending the email before he could second guess himself. Now, in the dim light, pop music from his childhood playing over the speakers and echoing off the exposed pipes and the high ceiling, he wonders if it was the right decision. He has nothing else lined up, no private tutoring clients, no freelance writing gigs—just a modest savings account that likely will not last more than a few months. He puts his phone away and finishes his beer and then signals the bartender for the check. 3. From there, he walks downtown, stops at a taco truck for a quick dinner, and then on a whim ducks into a cocktail bar on the ground floor of an expensive hotel, a narrow, rectangular space with dim lighting emanating from low hanging chandeliers and a chessboard wall that gives the place the vibe of a children’s dollhouse. It is packed with men and women in business suits here for an after-work drink, and Ahmed hears snippets of conversation about project deadlines and HR departments. The sole, overworked bartender is a guy in a stylish button-down and skinny jeans who looks like he plays bass in a band part time. Ahmed feels a twinge of sympathy for someone pursuing an artistic career like himself, before remembering that he himself has not written anything for years, not since his literary agent dropped him after the novel he would written failed to get picked up by a major publisher. He orders a daiquiri, which is the special that night, and he finds it surprisingly good, so much so that he orders two more and drinks them relatively quickly. Now he is very drunk, and he leaves the bar in a haze, stumbling past a group of women in pantsuits who give him a concerned look, the lights of the chandeliers at once too bright and too dim. 4. He can go home now, back to his apartment, watch a T.V. show or an old movie, or just masturbate to some porn and then go to bed, but now that he is drunk, he is decided why not stay out celebrate quitting his job, his fucking job that he never liked anyway—so he takes an Uber to Silver Lake and goes to a bar on Sunset, a hipster place with lots of people his age, women in stylish denim and leather jackets, men in patterned half-sleeve button downs, everyone drinking cocktails and talking in California accents, the familiar rhythm of millennial upspeak that once again makes him think of his life years before, when he would first moved to LA and gone out in groups like the ones he saw at the tables around him, having serious conversations about books and writing and art. But when he sits down in a corner table and sips the old fashioned he is ordered through a plastic straw, all he can think of is how he came here with Amy, after they were married, in those honeymoon years, how they sat at this very table, leaned close, the scent of her perfume clouding out all other scents, her voice drowning out all other voices. Now all he can do is concentrate on those other voices, each one reminding him of Amy. He opens up Facebook on his phone before remembering that she does not have a profile, and this leaves him wondering what her life is like now, whether she is happy, or whether she cries at night like he does, whether she sits in her new apartment and remembers the night they would decided to divorce, that terrible night under the glaring lights of their kitchen, their voices hoarse from another long fight, Amy’s eyes red with tears, her repeated declarations “I cannot do this anymore” and “You have become so bitter and angry” echoing in his ears. That all happened a year ago, but tonight in the bar he thinks of it like it was yesterday, and he is so overwhelmed with sadness that he only has this one drink, and afterwards stumbles out into the street, shielding his eyes from the glare of the streetlamp. 5. He walks for a while, back down Sunset and towards downtown, and in Echo Park he ducks into a dive bar that he remembers going to once with his old friend Veronica, who died in a car crash two years ago. She would been complaining about her girlfriend Rebecca, how they would tried to do an open relationship but how it had left them so bitter and jealous, but in those years, because Ahmed and Amy were happy, all Ahmed did was offer tepid words of comfort. Now, he sits at the bar, his elbows accidentally resting in a puddle of beer, a soggy receipt for over $100 clinging to his jacket. He orders a shot of whiskey and drinks it quickly, but instead of ordering another, he thinks of Veronica, how sudden the news was, how guilty he would felt for not reaching out before. He worries he would been a bad friend when she would needed him most. 6. From there,he takes an Uber to the Miracle Mile and eats a burrito at a stand he remembered going to years ago—then afterwards he wanders into a new brewery that is just opened up, in an old car dealership, an old-fashioned modernist building that dates back to the 1950s. It is an awe inspiring, incredible place, high ceilings, loud music, bright lights, people everywhere, but behind them, Ahmed can still envision the car dealership as it once was, the places on the tiled floor where the salesmen’s desks would have sat, the center platform where a glamorous new model might be displayed, the walls with faded marks where advertisements must have hung—all of it now disappeared, a prior century transformed by the brutal progress of history. Everyone is so young here, he notices, so young, in white t-shirts that cling to their perfect bodies, crop tops showing off their flat stomachs, high waisted jeans that look as elegant as evening dresses on their lithe bodies, everyone dancing wildly, pounding shots, yelling at each other over the electronic tracks, making out in corner tables, touching each other on the shoulders and the waists and the chests even while they wait at the bar to order. Ahmed squeezes through the throng and orders a beer and a whiskey and then goes outside and sits at a table. Out here it is still crowded, people smoking cigarettes and clustered around the small tables, laughter piercing the night in sharp spears of sound, but the music is dampened by the thick walls of the old building, and the cool night air feels refreshing against his skin. He sips his beer and stares at the row of buildings across the busy street, the palm trees silhouetted behind them looking to him like figures on a Grecian urn, cracked, faded, but somehow still surviving even after all these years. 7. He takes the bus from the car dealership to Culver City, feeling relaxed in the front seat, leaning his head back against the glass, the up and down rhythm of the bus strangely soothing to his stomach. When he disembarks, he walks for a bit before going into a karaoke bar that he would gone to with Amy for one of her friend’s birthdays, a small place in a strip mall that makes him think of the suburb where he grew up. He does not sing anything tonight but instead just sits at the bar, orders a simple lager, and listens while an Indian-American guy his age sings a song that Ahmed remembers listening to in high school, crooning out the melody with a heartfelt intensity and then ending with a bow to wild applause from the crowd. 8. From there, Ahmed walks for a while, down Venice Boulevard, the cars drifting by on his left, their headlights shimmering in the darkness, the palm trees and power lines swaying in the wind as if the whole world is slowly moving back and forth around him. Eventually, he reaches an old, speakeasy-themed bar, the sign glowing in the dark like a familiar landmark on a long stretch of highway. It is past midnight now, and the place is mostly empty, but it will be open for another two hours, and there are regulars there sitting alone at tables or at the bar in pairs, talking quietly while soft jazz plays. Ahmed knows the wood paneling is probably no older than a decade, but he likes to imagine it is been salvaged from an actual speakeasy, a bar from the 1880s that somehow survived Prohibition but then shuttered in the 1980s in the face of global capitalism. He sits on a stool at the bar and orders a brandy, which he drinks slowly, trying to savor the taste. He thinks about his novel, a multigenerational family saga which had begun in the early 20th century, part one a story of his grandfather’s life in Pakistan. He would researched it so meticulously, looking at old photographs, spending hours at the library reading books and newspaper articles, making timelines at his desk at home, posters pasted to the wall with all the complex politics he would hoped to capture. But for whatever reason, he would missed something—something fundamental in the story, some kind of heart. 9. He takes an Uber back towards his apartment in West LA, but decides last minute to go to one final bar in Westwood, a place he would once frequented as a student at UCLA, the kind of establishment that did not card and served cheap beer in pitchers and had big T.V.s that always broadcast ESPN. At this time of night, it is still crowded with students. Ahmed sits at the bar and orders a beer and then notices a student beside him, talking animatedly to his friend, a brown guy just like him, perhaps Indian or Pakistani, but possibly Middle Eastern or Iranian too. It is hard to hear exactly what they are talking about, and Ahmed catches only snippets, but what is more important is the way the guy looks—there is an earnestness in his expression, his wide eyes, his open mouth, the purity of simple and straightforward excitement. As with all brown guys his age, Ahmed feels a slight tinge of recognition, wondering at which points their experiences mirrored each other—but he also cannot remember the last time he would been so earnest about anything, the last time he would had that kind of look in his eyes. Even in that final year with Amy, he would been so jaded, so angry, decrying the publishing industry, decrying the world. Perhaps that was why she left, he suddenly thinks. 10. At home, he grabs a beer from his fridge and then sits at the bar of his kitchen counter, opening up his laptop, feeling compelled suddenly to write something. Amy used to sit here, he thinks, when they were still together, and from the kitchen while he cooked breakfast he could watch her as she worked, her bright eyes, the way she would run her hands through her hair in moments of intense concentration. There were still remnants of their life together across this apartment—a lamp that she would purchased, a mug she would given him as a gift, her calendar from the previous year that he would been unwilling to take down and that still had her handwriting on it, reminders to take her birth control pill and turn in their rent checks and call her relatives on their birthdays. But he tries not to look at these objects, even as he thinks about them. Instead, he opens up Word on his laptop, his mind still fixed on the image of the brown guy in the bar, the earnestness of his expression. Ahmed is more drunk than he is been in a long time, and he can feel all the alcohol in his body, pounding through his head, his bloodstream, his heart. But he also feels a sense of clarity he has not felt in a long time, as if he is finally understood what was missing from his early work, as if he is unlocked the secret to something profound, an idea about life that if he loses he will regret for the rest of his years. He takes a swig of beer and let us out a breath. And then he begins writing.",
    "TwoSecondsOfInspiration": "For as long as he could remember, Jalil had always been an Aghazade. “It is a term of respect,” his father used to say. “It means you are destined to bring about great change.” Jalil’s father was the one and only Alireza Modaressi, one of the twelve members of the Guardian Council, and the Friday Prayer leader in Qom, Iran’s holiest city. When Jalil was five years old, he would gone downstairs one morning to grab breakfast, and he would seen his father sitting at the kitchen table, dressed in full religious garb, turban and cloak, sipping tea with Ayatollah Khomeini, the Supreme Leader whom he would seen on TV every day of his life. After that day, Jalil had realized the true power of his father. Growing up, Jalil was never allowed to leave their mansion without permission. If he wanted to go to the park and play, their servant would have to call ahead, and Jalil would always show up to a deserted park that was closed to the public, just so he could play football with other little Aghazades, the sons of other powerful families, as security officers watched them nearby. Jalil was homeschooled and forced to study the Quran day and night. His teacher, another young Aghazade, taught him every subject from math and science to religious studies, but Jalil’s favorite subject was art. He loved the work of Bahman Mohasses, the “Persian Picasso” who painted ghastly Minotaurs and grotesque creatures that haunted Jalil’s dreams. “Why would he paint those things?” he asked his father once. “Because artists are heretics!” his father replied. “They will be damned in hell on Judgement Day.” Religious clerics abhorred art and viewed it as the devil’s distraction, but their hatred only intensified Jalil’s fascination. When he was 13, he told their servant to buy some canvasses and began painting secretly at night, drawing bowls of fruit with vivid colors that filled him with joy. After a year or so, his paintings took a Mohassesian turn and became absurdly grim: three-headed demons shrieking at the sky, men with tortured faces plunging into a lake of fire. Once, he even drew a little boy standing on a chair beneath the word Allah, looping the first letter around his neck like a noose. Jalil was shocked by the anguish that lurked in the depths of his mind. When he was 25, he graduated from seminary school and packed his bags to leave for America. His father wanted him to study International Relations at Georgetown, and he did not know when he would be back, so he stuffed his paintings in a box and tucked them away in the back of his closet, where nobody would find them. At Georgetown, he went to class in full religious garb to represent the Islamic Republic. When other students found out who he was, they were either cordial towards him, out of respect for his culture, or they avoided him entirely. One guy named David was particularly obnoxious. David would show up to class with slicked-back hair and designer button-ups, and he would take frequent bathroom breaks to powder his nose and come back twitching and sniffling, jumping out of his seat to engage in political discussions. “All I am saying is, you people are fucked,” David told Jalil one day after class. “You Iranians have the audacity to attack an American tanker in the strait of Hormuz. What the hell were you thinking?” “It was not us. We did not do it.” “Well then who did?” “I do not know.” “Oh c’mon! This is what you guys do every time: deny deny deny!” “I am just being honest with you.” “Oh are you?” David chuckled derisively. “You should be careful about what comes out of your mouth when you talk to me. Do you know who my family is?” “No,” Jalil said. “Let me put it this way: my father was in the Situation Room last night with the president and his staff. They are going to send B-52 bombers to your country and blow you to smithereens.” Jalil was concerned. Powerful Americans like David’s father were nationalist hawks, and war with Iran was a real possibility. He wished that he could somehow build kinship with David’s family, so that night he went home and began a new painting. He painted the word Allah with intricately intertwined Persian letters, the first three letters shooting up to give the illusion of stripes, and the tashdid overhead peppered with glitter to resemble fifty sparkling stars. “This is for you, my friend,” he presented the painting to David before class the next day. “It is a little gift that I made. It is the Muslim God, but if you turn it sideways, it kind of looks like an American flag. In Islam, we are all considered brothers,” he gave David’s shoulder a tender squeeze. “Give my love to your family, will you?” David turned white as a ghost. He stared wide-eyed at the painting, turning it this way and that way to admire it. “This is, uh, incredible,” he muttered. “I am glad you like it.” “How did you even do this?” “I have been painting for a while.” David’s expression softened and he fumbled over his words, trying to say thank you. He squared up and gave Jalil a firm handshake. “You know, my father paints too. He volunteers at the VA hospital and paints portraits of wounded veterans.” “That is great,” Jalil said. “I would love to check out his work sometime.” That weekend, David sent Jalil a wonderful email about how much his family loved the painting and how they would hung it up in their living room. Jalil called his father in a cheerful mood to relay what had happened, but his father was not pleased. “You know I do not care for artistic foolishness,” his father said. “But dad, I am telling you, the family is really happy. This is a good thing.” “We are on the brink of war, and instead of stepping up to be a leader, you are over there drawing pictures!” “I am trying to build connections, dad. And I think I am–” The line clicked and Jalil knew that his father had hung up. He stood stock-still, rubbing his eyes in frustration. He wished that his father could have seen the unexpected jubilation on David’s face, the glint of confidence in his eyes when he would shaken Jalil’s hand. It was obvious that the painting had moved him, but Jalil was so shaken up now that he did not know whether he would made the right decision. The next day, when Jalil was eating lunch in the cafeteria, the evening news blaring from the TV mounted on the wall showed Iran’s president signing some papers, along with four jet-black planes flying menacingly over the ocean. The caption beneath read, “Consensus reached, but B-52 bombers send a clear and unmistakable message.” Jalil grinned. He knew exactly what would happen. The bombers would fly around aimlessly for a while, and some kind of Navy battleship, the USS Something-Or-Other, would be stationed near the Persian Gulf for a few months, just to make it look like something was going on. But there would be no aggression, no military intervention. It was all a show, a bunch of political theatre. Somewhere, his father was probably sitting cross-legged against a cushion, sipping tea in front of the television and smiling at his colleagues, at all of the big-wig clerics who would take credit for having thwarted an American attack. They would joke that America was all pomp and pretense, no longer a global hegemon capable of policing the world, and that the Islamic Republic was an emerging power that sent shivers down Western spines. More than anything, Jalil thought about his painting and his father. His father would probably spend about two seconds wondering whether the painting had truly made a difference, and that two seconds was all Jalil needed to feel inspired, to know that he was not just an Aghazade, but an artist capable of enacting great change. A few weeks later, at the end of the semester, Jalil found a package in front of his apartment door. It was from David. He opened it and saw that it was a painting of a man lying in a hospital bed with an American flag draped over him like a blanket, his head bandaged and his casted leg propped up on a few pillows. He was staring ahead, smirking and holding up two fingers, a sign that Jalil knew meant peace.",
    "MonitorWorld": "She died in the game, and saw him looking at her. That summer, she always spent her lunch outside of the hangar. She ate in her car, or squatted in the shade of the fence, dribbling bottled water into the dirt. There was a game she played on her phone, shooting zombies. Across the parking lot was a pilot school, with a flat roof and a smoky glass door. She never saw a single airplane take off from the tarmac. At lunch, or at five thirty when she was coming out at the end of the day, she would see the man standing on the deck in front of the school. He wore aviator glasses and had a cigarette. She never saw his eyes, but she knew he was looking at her. He had short, bristly black hair, wore a crisp, white shirt with an embroidered insignia and pressed, dark pants, even in the heat. He must have been someone at the school; he must have been a pilot. If she looked him in the face, he did not turn away. Not his mouth, not his body, nothing about his posture ever changed, and particularly not the angle of those impenetrable black lenses always directed at her face. That summer she was twenty-five. Her boss was a guy with a plane and a hangar. She spent from nine a.m. to five thirty p.m. in the hangar, which had a steel-framed ceiling like an enormous tent. It was partitioned so her boss’s plane was separated from them by a makeshift wall, and he rigged up electric fans around the space to alleviate the dead air. She and two others, one twenty-one, one twenty-two, worked on shiny new iMac computers with little labels with their initials: N.R. for her, A.M. for the twenty-one-year-old, K.L. for the twenty-two. They edited web copy. The web copy read as suspiciously scripted, sent in by cheap ghostwriters from non-English-speaking countries. They posted the articles on websites with too many hyphens in the URLs and shared the links on social media websites under fake profiles they made up by the dozens. In the hangar, their screens were visible at all times. There was no privacy. N. hated being the oldest worker there. All around them was arid desert. Beyond the pilot school, there was a diner where some early mornings N. got coffee and listened to the TV. The local news was full of stories of pedophiles and abducted children, bus drivers who were keeping women locked up in their basements for years. Listening to it, you could easily be convinced the world was dark and unnavigable, that danger could swallow you up on any street corner. The waitress was like a character from a Lucia Berlin story. She had brown hair bleached gold by sunlight and bronzed, spotted skin. She knew the girl by sight; she acted motherly toward her. When N. sat down at the cafe, the waitress poured her coffee first, moving protectively through the weather-beaten men wearing the same dark glasses as the aviator who watched her. At twenty-five, N. believed herself pretty enough to be looked at and too old to be mothered. Before that, she had been awkward. In high school, her cropped hair puffed out unevenly and eyeliner ran off her flat, oily eyelids. Her acne had persisted even after her breasts and hips failed to fill out. Her skin was permanently sun-darkened from the laps she would run around the football field. She had grown out her hair, found a skincare routine, and bought different eyeliner, but this last thing, the tan of her skin, was—despite the papaya soap she bought from the Vietnamese market and the kojic-acid soap she ordered from Japan via eBay—the one thing she had not managed to change. The Cave had popped up in her sponsored ads. It had a dark, pixel-art interface that looked decidedly retro, a callback to ’90s anime predicting what the Internet would look like in the future. The motto was: “for lovers of the underground.” The chat function used avatar sprites, like something out of MapleStory, and everyone listed some kind of Internet handle instead of their real names, which made it feel a little more like an actual game set in some digital alternate universe and a little less depressing than real life. N. uploaded two pictures into the app. Her username was dDdgh0st. On her profile, under “Occupation,” she would written: “disembodied digital ghost.” His name was agamemnon_the_king. His chat avatar had purple hair and green eyes. There was one picture, which showed the serious, elegant face of a man with long hair looking directly into the camera, shot in black and white. His age was 31, and his occupation was theatre. Hello, he wrote on the day they matched. What is up, she said. It was evening, she was in the kitchen, and over the island, the canyon sunset was falling through the window. In the refrigerator, her mother had left a wrapped bowl that N. was warming up for a meal. Why is a nice girl like you in a place like this? It was such an old-fashioned line, so casually derogatory; she was intrigued. Looking for a prince, but a king could be better, she wrote. You appreciate me more than my wife does, he said. After a few moments, but not so quickly as to be unconfident, he added, (That was a joke.) Her mother had bought this one-story house in a half-finished development the previous year. There was no father in the picture. Bushes of wild yellow flowers dotted the trails along the neighborhood, and if she got close enough, she could hear the dry hum of bees. There were not enough streetlights and night driving was dangerous. The long distance from the city center would have made it hard for the girl to see her old friends, if she had had old friends, but she had not hung onto her friends anyway. Her mother was an emergency-room physician and was never home during normal hours. Since N. had moved back, mother and daughter passed through the house like two users in an A/B test, with only the bowls of food she left on the counter and the drip coffee N. set to be ready at four p.m. as the tracks of each other’s existence. It had been almost a year since Hillary lost the election, since people had cried walking that night on the streets of New York, and nearly three months since she would left graduate school and found a job off Craigslist editing web copy in an airplane hangar. She was giving half of each paycheck to her student loans. In the bedroom of this home, which was not her childhood home, N. lay on the mattress with the red, flower-patterned duvet she would had as a high schooler, folded her clothes into the white dresser she had once put her first bras into, and drew pictures on a Wacom tablet at the same desk she would studied for her AP Statistics exam. When it got dark, she lowered all the blinds and tried not to feel uneasy at being alone in an empty house on the ground floor. At night the air was genuinely cool, and she would take out her favorite of her graduate school sweaters, then huddle watching anime at her desk and telling herself she was going to shower and sleep, in just ten more minutes, fifteen… She would downloaded The Cave because she wanted something to happen. A few hours after her last message of lol, just as she was getting ready to shower, agamemnon_the_king wrote, So, what does a nice disembodied digital ghost like you do for fun? Haunt Tumblr, she wrote back, play pranks on the audio tracks of YouTube videos, steal webpages and bring up 404 error codes. He said, What a busy life. Do you ever come out to play in the real world? The King lived in a new apartment complex that was not quite downtown. It took her forty minutes to get there. Racing through the empty intersections and the stoplights blinking red and green, N. thought, Am I really going? Is this really going to happen? She had never done this before: gone to the house of a man she had just met that same day on the Internet. Her car felt like a protective bubble of unreality from the outside world; she felt like she was in a video she could pause at any moment; she was not really inside her body. It was much more plausible to think she was astral projecting and her real body was somewhere else, in bed, sleeping. Her body was only dreaming it was in the car and turning off the exit ramp and stepping on the brake and parallel parking in front of the address she would gotten from agamemnon_the_king. Her body was only dreaming she was texting him, I am outside!, and checking her reflection in the rearview mirror. Everything was a fiction, a fantasy imagined by that body, still in pajamas lying in her bedroom… agamemnon_the_king walked out of the sliding glass doors. In Real Life, he was short. He had sloped shoulders, a long neck, deep bags under his eyes visible under the streetlight. Then she really was following him inside, up a silent, smooth elevator to a living room where there were stacks of heavy, white books, a deep couch, framed pictures on the wall. He was a little bit uglier than she had thought he would be, and this was comforting and made the scene feel more like play-acting. The man offered her dry wine in a crystal glass, asked her if she was hungry, leaned over the kitchen island, pushed her lips open with the edge of the glass. The wine was dry and left a taste of salt on her tongue as she swallowed. This, the injection of her sense of taste, brought the scene more judderingly into reality for her. She was like Persephone, eating in the underworld. He refilled his own glass, and something about his hooded eyes, how they monitored her, scared and thrilled her. He did not turn on any lights in the bedroom. There was more art on the walls, in large white frames; the shapes were fleshy, grotesque, erotic. The whole time she had been smiling, joking, performing. And still she felt it was not really happening. She was in a cutscene she had to see to the end. This is real/This is not real, she thought, like a coin toss. The man laid her on the bed, peeled off her sweater, ran a finger from her collarbone to her ankle and said, “You are very lovely.” Liquid pooled into her underwear, which he took off a moment later. When he put his fingers inside her, she thought, apropos of nothing, of the aviator, the dark sunglasses observing her under the omniscient and ravaging sun. The next morning, N. drove to work from the man’s house just after dawn. She had slept for perhaps three, four hours. At the diner, the Lucia Berlin waitress came over with the coffee pot. “So early today,” the waitress remarked. “Here you go, honey.” At work, she nodded sleepily over the lists of “10 ways to get the most out of your garden fertilizer” and “Try these top 5 anti-virus software for business professionals.” She plucked at her sweater feverishly; should she take it off? She did not want the others to notice she was wearing the same T-shirt. She could still feel the King’s fingers in her. N.’s organs writhed, and she squeezed her thighs together as tight as they would go. “It will not let me make any more Facebook profiles,” the twenty-one-year-old said suddenly. Their boss stood up. “Let me see?” “I am having the same issue,” the twenty-two-year-old said from his desk. N. looked at the article she was publishing on best-garden-hose-enthusiast.com. After she published it, she was supposed to share it on four different social media platforms under fake names. She opened the Gmail account she would made under the name Linda Hallberg, contributor at best-garden-hose-enthusiast. Your IP address has been blocked due to suspicious activity, Facebook informed her. Her boss went around the other side of the partition and began rummaging around. “What about you?” the twenty-one-year-old asked N., but N., who had her earphones in, pretended she did not hear. “What are we going to do?” the twenty-one-year-old asked. “I think he is going to scramble our IP address,” the twenty-two-year-old said. “How?” The twenty-two-year-old shrugged. “I do not know. I just hear that is what people do.” Meanwhile, N. thought, gazing at the Facebook email, no one knew what she had done last night. The sex had been good—so good that, remembering it now, her legs went weak, and she wanted to drive back to the King’s house and repeat everything they had done the previous night, right this instant. She thought of the boys she had slept with before, the awkwardness, the self-consciousness, how the sex had at best been almost enjoyable but never quite. How distant and unreal they felt now. She had come out of the night and left the King’s house alive. Her boss came back and started fiddling with another device. When he bent down, the sweat along his hairline glistened under the artificial light like a lick of slime. It could not be good for them, working in this heat day after day, even with the fans on. N. stared absently at the shiny skin on his forehead. The air felt stifling, the writhing in her stomach intensified—was it the thought of the sex? She fanned herself with one hand; the lights above seemed too bright, and the twenty-two-year-old asked, “Everything all right?” She nodded and scooted her chair directly in front of a fan. She was fine, it was just, she felt, quite, very hot— And then she was stumbling out to the parking lot and the twenty-two-year-old was following her, asking if she could drive home okay, N. was waving him off, in the car she checked the rearview mirror and saw her skin was pallid, damp, she pulled out of the lot in a reckless swerve, through the rear window she could see the aviator, who had come out to the deck, who was staring at her car under his black sunglasses, standing at the porch of the pilot school. His gaze made her stomach churn more; she stopped the car for a second with an abrupt shuddering of the brakes. She wanted to step out, speak to him, but then she saw his foot move, was he going to walk towards her? Her foot swiveled to the accelerator, she was out on the street, she managed, barely, not to hit the car behind her changing lanes off the freeway, and in her mother’s house in the half-abandoned neighborhood, she was tugging off her sweater and heading to the toilet and lifting the lid and vomiting out an egg-colored bile—but why? She did not feel ill, no, it was good what she felt, tingling all over, from her belly to her toes, yet still—she lifted water into her mouth from the bathroom sink, flushed the toilet, realized she had to pee, pulled down her pants, sat down, and saw the smear of blood on the underwear she had not changed from last night: oh. She had started her period. In graduate school she made an animated short titled CHECK THIS BOX TO VERIFY YOU ARE NOT A ROBOT. It started with a tiny girl with an electrical outlet in her back waking up in an empty bedroom. The girl, the room, everything was sketched out with rough lines and no color. The scene expanded, the girl’s bedroom was actually an enormous control room with a spread of computers and a thick coaxial cable dangling on the floor. The girl plugged herself in and the first monitor turned on. Her avatar popped up on screen, reborn into a new world, and this world was fully realized: it had color, shape, dimension, music, cotton-candy trees. But before long, blocks of gray crept in, there were shadows in strange forms on the floors of the treehouses, the background music turned ominous, the screen flickered, pixelated, squares of gray dotted the sky in binary patterns (cut to: the physical body, comatose below the monitors, twitching), and finally, once the dreamy pink world degraded into a sketchy, draft version just like the real world outside, the avatar found another room with a monitor. There was a new character, a man with a fixed smile, like a mask. His speech scrolled across the screen: Welcome, is not it beautiful here? This place, it is so lovely, I could just stay here forever, sit and watch the world go by without me. This place, it is so lovely, I could just stay here forever. Is not it beautiful here? To sit and watch the world without you. And the second monitor turned on, there was another world in there, full of color that started to bleed out over the edges of the screen, greens and oranges and yellows, pumpkins, a road, the man turned to look, the avatar saw the man had no back, he was all face and nothing behind it, he was completely depthless, a straight line, and the world in the second monitor expanded out and intruded more into the first… N. was thinking of expanding it into a video game. The girl’s avatar would hop through different monitors and their associated worlds, meeting strange figures (once people?) who talked in long strings of zeroes and ones or Wingdings. Half-heartedly, she was trying to decide how she wanted the story to end: what if there was an option for the avatar to remain in the monitors forever? Maybe it was easier to stay, even in those decaying empty places, than to emerge into the Real World. Maybe all the characters the girl encountered had once been Real People who decided to move into the Monitor Worlds for good. She thought that the girl plugged into the computers probably had some trauma at the back of her life (why else would she avoid her real life so hard?), but N. was not very interested in the “why” of things, only the “what.” And more and more, she liked staying in the imagination of the Monitor Worlds, creating tableaus of different worlds and color palettes, then ruining them all with a few mouse clicks. The second time she met the King was on a Thursday. He called her over late, eleven p.m., and she once again fell into the comforting sense that they were play-acting. Nothing that happened this far into night could be real, including their meetings, which felt clandestine for no reason. He greeted her with a flourless chocolate loaf cake sprinkled with powdered sugar, and she wondered what he was overcompensating for. On his couch, which was expensive, deep, and very comfortable, he massaged her calves. He had a strong grip. “Do you do sports?” she asked. He said he had a black belt in judo. She felt the thrill of being cared for in a dangerous situation. He had a shelf of DVDs behind the couch. For movies, there were names she did not know, like 10 to Midnight, Death Wish II, Basket Case, Cat People. For music, there were CDs: The Police, Depeche Mode. N. picked up a DVD and looked at the cover: garish and pulpy. “I do not know any of these,” she said. “They are from the 80s. Classics.” The photos on his wall were of naked bodies arranged in strange poses against a brutalist landscape of a stark black house. The bodies were thin, pale, long-legged, firm. The pictures were not sexy—something about them was very cold. “What are these? Porn?” The King laughed. “They are by a Japanese photographer. He is famous.” “They are kind of creepy.” Nothing was real, which made her bold. “Are you creepy?” “I like them. Everyone seems like they could turn violent in just a second.” That was what it was, N. thought. The feeling she got from him. Of not knowing whether the next moment would be safe. What was so alluring about being in his company: he rubbed her legs, and she did not know what he would do next. The King slid his hands up her thighs. During the night he started snoring with the deep, throaty rumble of an old man. This punctured the film of unreality and N. wanted to leave. She shifted restlessly around on the bed. One of the small photographs by the Japanese photographer was hung on the wall. In the background was a tiny woman in a ballet pose who seemed about to take off. Swallowing the foreground was a man facing her—his posture, the adamant line of his legs and shoulders, was threatening. On Saturday she was watching TV on the couch when her phone pinged. Still recovering from the scratches you gave me, the King said. The intrusion of the King into her weekend morning was unwelcome. Lol, she typed, though she did not find it very funny. He followed up shortly: What are you up to? I am staying home today, not feeling well Oh no, what is the matter Stomach issues Where do you live? I can bring some soup N. paused. Below her stomach, she felt her intestines knotting together again. Was he being caring, or was this crossing a line? Instinctively, she did not want the King to know where she lived. Even if she did not live with her mother, she would not have wanted him to know. She closed her eyes, her mind swimming with feverish images: the dark highway, the white sugar on the chocolate cake, the airplane hangar, her reflection swimming in the black coffee in the diner… “Did you eat lunch yet?” her mother’s voice floated into the miasma. Oh. N. opened her eyes and saw her mother there, looking tired. It felt like a long time since she would seen her. “Sorry, Mom, I forgot to start the coffee.” She moved to the couch and put a hand on N.’s forehead. “What is wrong? Are you feeling sick?” Her hand was cool and dry. “My stomach’s been a little funny.” Her mother brought her hands down and squeezed N.’s feet, hard. “Eek!” She squirmed. “Mom, it is okay. I already took some ibuprofen.” But her mother’s grip relaxed her. Her mother said, “I will make you some ginger tea.” N. watched her set a small pot on the stove. Her mother was short, thin, and pale, with sensible short hair and a competent, no-nonsense manner. Even watching her bent over the cutting board, N. felt protective of her. “How is the hospital?” she asked. “We had a sad case last night. This guy brought a girl in with bruises all over her neck and face. He said she would fainted.” A whispery feeling ran up N.’s skin, like walking through a spiderweb. “Did he hit her?” “She said she ‘fell’ because she had ‘low blood sugar’ and kept asking, ‘Can my boyfriend stay?’” Her mother sighed. “I asked if I could speak to her alone, but she would not let him leave.” “At least he brought her in?” “These abusers do all sorts of things,” her mother said. “You have to be careful.” She brought the mug to N. and smoothed her daughter’s hair. When N. brought the cup up to her mouth, the smell of ginger was spicy, pungent, traveling through her nostrils up to her brain where she imagined it lighting a tiny fire. The King started texting her more through the weekdays, even when she did not reply. Think I might need someone to help mount some shelves, haha, have you heard that one? Did you eat lunch yet today? How is work? 3 PM slump I get headaches when it is hot like this It is so dry I have a nosebleed At lunch, N. checked her messages in her car sitting outside the hangar. She tried to identify what she was feeling, and it was repulsion. She did not like that the King was trying to talk to her more now; it was needy and made their encounters less flimsy, less transactional. In the side mirror, she saw the door to the pilot school swing open. The aviator came out and lit a cigarette. It was hot, but there was no trace of sweat on his starched, white shirt. N.’s cellphone pinged again. Are you busy tonight? This would be the last time, N. decided. The King was getting boring. The fear she had so viscerally felt had been replaced by a kind of pity. When she went over, it was raining and only six p.m. In the cool gray light of his living room, the man looked sagged and tired. He brought her a small cup, she brought it to her mouth, took a gulp, almost gagged. She had not been expecting wine. Drinking alcohol without having eaten, N. felt herself growing languid. Turning her eyes onto the man in the early-evening light, she saw the bags under his eyes were puffy, and there were even a few gray hairs at his temple. “What have you been doing all day?” she asked. “Watching this old reality show called To Catch a Predator. Have you heard of it?” “No.” N. hesitated. “True crime?” “Yeah. These pedophiles, it is so funny.” The man laughed a short, ugly laugh. Had he always had those jowls? “Some of them say the craziest shit. My favorite one…” Later in bed, after sex, which for the first time felt perfunctory and disappointing, he told her he was writing a play. “What is it about?” “Charles Manson.” “The cult guy?” “He just died, you know.” “He was still alive? I do not even know when all that stuff happened.” The man chuckled. “He was misunderstood. There were a lot of ways in which he was a genius. And charismatic. The guy was a leader! But everyone only remembers the one thing.” N. kept her voice very measured. “But he was a murderer, right?” “He did not actually kill anyone himself. It was his followers. The young women.” Suddenly, the King lunged at her stomach and tickled her. “Girls can be scary!” His voice turned high-pitched, incongruously childish. N. wanted to ease away from his circling hand. “So, what is the new thing about the play?” She tried to change the subject. “Like, how is it different from what actually happened?” “I am thinking of having all the parts played by children. Twelve and under.” “Like, Charles Manson and all the women and everyone are just going to be kids?” “Do not you think it would be cute? All Lord of the Flies. Inherent brutality of humanity and all that.” His voice had turned crueler talking about the children. She did not like the way he sounded. She imagined a young kid on stage, artlessly acting out an orgy. She felt tense, her hands tingled. “I am going home,” she said a moment later. She sounded very natural. “Got To make dinner.” “You sure?” He smiled. “You are welcome to sleep here if you want, you know.” “I want to sleep in my own bed.” “What is your bed like?” N. turned her head. “That is a weird question.” “I am curious how you live,” the King said, also sitting up and kissing her on the cheek. “All right, I will walk you out.” Sitting in her car parked on the curb, she tried the key again and again. “Shit.” She took the key out, shoved it back in, turned it again. “It is not starting.” “I can jump it,” the King said. “Do not worry.” While she waited for him to come back, she wondered if she should call her mother. But nothing has happened, she told herself. Nothing has happened. He had not said anything she could point to as obviously sketchy. She remembered the excitement she would felt the first night meeting him. He had been an unknown, she had felt the rush of getting away with something. There was the way he would looked at her over the food he gave her the first night. His eyes, hooded, intent, obviously monitoring how much she drank. (The casual way he put his hand on the back of her head when she was giving him oral. There was no pushing, but there was the suggestion that if he wanted to, he could.) No one knew she was here. “I have got it,” the King said from behind her. He insisted on following her in his car. “No, no,” N. said, shaking her head, “it is fine. I am just going home, it is a long drive, do not worry.” Then she bit her tongue, wishing she would said she was expected somewhere else. “I will just go along with you a little bit to make sure there is no problems. What if your car dies again?” “I have triple A,” she lied. “Do not worry,” the King laughed. Under the streetlight, his teeth were not very even. “I am not busy. It is not any trouble.” “You really do not have to.” N. shrunk away, then, because she was still alone with him on the sidewalk and she was afraid to be rude, she said, giving an excuse: “I live with my parents, so…” He did not seem surprised. “I will not come in,” he promised. “I will not even stop. I will just see you park and make sure everything’s good and drive right off.” He will not take no for an answer, she thought. On the drive back, her arms were locked in so closely to her body she could feel the tightness of her inner elbows. In the rearview mirror she saw the King in a Chevy Tahoe trailing closely behind her. There was heavy traffic. She tried to subtly lose his car, but every time she changed lanes, he reappeared on her left or a car or two to the side, then directly behind her, skimming along confidently. He was wearing black sunglasses, so she could not see his eyes. As though he knew she was looking at him in her mirror, he suddenly grinned. I am never going to see him again, she thought. The world seemed too real now. N. pulled off the freeway early. The stop was near a plaza with a frozen-yogurt chain and yoga franchise. In high school, she would come here after track practice. N. swallowed hard. The Tahoe pressed behind her. She kept driving, trying not to look around too much or go too slowly. She saw a side road with a stone sign and turned. There was a parking garage. Some neat shrubs outside. Without looking at the numbers, she pulled into a spot. In the second between the death of the engine and the shriveling of her seatbelt, a black hole opened inside her lungs. She opened the door. His car was idling behind hers. She prayed whoever belonged in the actual spot did not show up. “Well,” the King said, rolling his window down and looking at her without taking the sunglasses off, “everything looks good?” “Yup.” N. forced herself to smile. “Nice little neighborhood.” “Yeah.” The King looked around and said, “No one’s here. Come here a sec.” Unwillingly, N. approached the car window. He pulled her face in by the chin and kissed her on the lips. “See you next time.” God, his lips are dry, she thought. And too thick. Disgust ran down her esophagus, and she had to stop herself from wiping her mouth. “Next time,” she said easily, and with enormous, invisible effort, lifted the corners of her mouth. She brought her hand up and waved. Surely he was not going to wait to see her unlock a door and go into one of the houses? No, thank God, he was not. The King rolled his window back up and smiled his unpleasant smile at her again. He pressed the gas on his car, looped through the roundabout, and exited the neighborhood. By the time N. got back to her real home, it was dark. She would waited for ten minutes in the parking garage, hiding in the back seat of her car with the lights turned off in case the King, for whatever reason, decided to come back. Then she would driven aimlessly for nearly two hours, going the wrong direction on purpose, before pulling into a gas station, filling up, and at last setting her route to home. From the moment she would peeled from the curb in front of the King’s apartment until now, she had not let herself think or feel too much. Now, her head felt hot, and her heart strangled inside her airless, black-hole torso. She put a hand on the wall to steady herself. Then she turned on every single light in the house and went around pulling down the blinds one by one, avoiding her reflection in the dark pane, avoiding looking through the window to anything beyond, because, because what? In her bedroom, she locked the door. Why are you feeling so scared? There is nothing to be scared of, she told herself. She forced herself to shower and pull on her favorite sweater. She took out her laptop and got into bed. She opened a video game. Her avatar ran around a dirt field shooting little pixie zombies who turned dark green, then purple when they were hit in the brain. The soundtrack was a cheerful piano medley. Gradually, N. felt sleepiness overtake her. She became aware she was hungry; she had not eaten. Her eyes grew heavy on the pillow. I do not have to decide right now, she thought, what I feel. Also, nothing happened, she thought. Maybe I was just being paranoid. She drifted off with the sound on her computer still going and all the lights in her room still on. Perhaps because of that, or because her sweater made her too hot, her dreams were fitful, and all through the night she could not quite tell if she was fully asleep or half-awake. Her stomach hurt. In the bathroom, no vomit came out. When she walked outside, there were noticeably fewer bees than there would been in the middle of summer. Nothing had happened. Nothing had happened. She typed his name into Google. First name + city + theatre. First name + city + name of a university on a hoodie she had seen in his closet. A reverse image search of his profile photo from The Cave. Nothing. His invisibility on the Internet cemented how little she knew about him. An air of doubt had crept into her searching: that she had ever met him or driven to his house, that she had lain on her back in a dark room with pale photographs on the walls… First name + Charles Manson. First name + Japanese photographer. No hits. She blocked the King’s number. She started avoiding her phone, started turning the radio on when she was driving, started driving faster, started looking out for a black Chevy Tahoe. She started eating her lunch inside the hangar, started leaving work later, started not wanting to be alone, started wanting witnesses. He would not be able to find her; he had not come to her house. They only knew each other’s first names. The fear she felt only in his apartment, only when she had wanted to feel it, was oozing through the cracks in her bedroom walls and made her afraid when driving at night. A week later it was just her and the twenty-two-year-old in the hangar. Their boss had left for lunch. Their mouse clicks echoed into the silence. She could not focus on the horticulturalist-tips-for-single-moms.com article. Coiled claustrophobia threatened to pop every blood vessel in her body. Stealthily, breaking the rule she had set for herself, seeing the twenty-two-year-old immersed in a YouTube video that clearly was not about his assigned topic, best-mixed-martial-arts-gear, she opened a private browser and continued searching for the King online. First name + phone number. His first name had an unusual spelling. “Hey,” the twenty-two-year-old said into the dead air of the hangar. “Did you bring lunch? Or do you want to go out and get something?” “Mmmm,” she non-answered. And there—in an online directory, the first result on the search engine—were three hits. Something. She clicked on the page. The directory was like an online Yellow Pages. There were full names, addresses, phone numbers, even dates of birth. All this information just available with some swipes on the keyboard. The first two results were people with different spellings of his first name and who lived too far away. The last result was the name of the man who must be the King. The street address was the one she had driven to. He was a real person. The date of birth listed was 1975. She felt her intestines writhing again, like snakes. Pressure ballooned inside her head. N. logged onto Facebook. She was still using the Linda Hallberg fake account. She typed the full name she had found into the search bar. There was one in Arizona, one in Colorado, one in Hong Kong, and there, sixth one on the list: the Facebook profile with the same black-and-white photo from The Cave. In the introduction box, the name of the city they lived in. The name of a liberal-arts college in Vermont, not the one from the hoodie. And a graduation year—1997. She counted backward in her head. He must be at least a decade older than he had said. She pushed her chair back. “Yes, let us go get lunch,” she said to the twenty-two-year-old. Though it had been a long pause. Though it was too late to respond. The twenty-two-year-old, whose name was Kevin, looked at her, a little surprised. As well he might, she thought, because she had been unsociable for more than two months. He turned out to be gracious. “Cool. The diner?” N. drove them the four minutes to lunch in her car. The aviator was standing outside the door of the pilot school smoking. In the diner, the TV news played a story about a woman who had escaped her father’s cult. The Lucia Berlin waitress brought them glasses of ice water. “Hi, honey,” she said to N. “This your coworker?” Kevin was short, baby faced, and very, very normal. He was originally from Texas and had studied business merchandising. He speculated on their boss, their jobs, how much longer it could possibly last. “I mean, it is not like we are making money, but what are you going to do when he runs out of cash?” “Oh. I did not think about that.” N. could barely chew on her burrito. Out of habit, she had asked for a black coffee. “You were in New York, right?” Kevin went on. “But your family’s here?” “My mom,” N. said. “And I did not want to leave her alone.” “At least you know people here. My parents moved here in the middle of college.” What people? N. thought. People with real lives? I do not know anyone with a real life. “I do not know a lot of people. I was seeing someone for a bit. I just stopped.” “I am sorry to hear that.” Kevin stopped, then asked, since she was clearly waiting for him to, “Any particular reason, or…?” “Well,” N. hesitated, “I started feeling like there were some things that did not add up… Like some of the things he said…” The thoughts congealed inside her. The King, 31, occupation: theatre. If he was born in 1975, he was forty-two years old. Some of the things he would said about her body, which she would found so flattering and old-fashioned, now she thought he might have said them because he was so much older. How had she let him touch her? What signs had she missed? And what signs had she seen and let go? Had he done this before? The first night, had not he been so confident, so relaxed? How many young women had he seduced? What kind of man… “I mean, he did not do anything wrong?” she said, half question. “Technically. Except…” “No, no.” Kevin leaned forward, shaking his head. He had very pale, fine eyelashes in his baby face. “Trust your intuition. You feel like you cannot trust what he says, like you have been lied to—no matter what, that is not a good way to enter a relationship.” He crooked a smile. “I am sure your mom would want you to be careful.” The overhead lights clarified the tiny bubbles at the edge of the coffee. Suddenly N. wanted to cry. In the rush of everything that had happened since she moved home, her unhappiness, her frustration, the recklessness with which she would met the King, she would forgotten—she was someone is daughter, a beloved daughter, and her mother would be sad if she were hurt. In the car on the way back to the hangar, they were silent. On a loop in her mind, N. recalled the times the King had touched her; she felt disgusted, but she had also let herself enjoy it. She could not lie to herself and say she had not liked it, at least in the beginning. How horrible that she had let herself be touched by him those times, had been so eager, even— “I have never actually seen a plane take off from here,” Kevin mused, looking out the window where the roof of the pilot school was coming into view. The thought of the aviator being there, watching her from behind dark glasses, infuriated her. She turned into the parking lot with the chain-link fence. In the rearview mirror, she saw the pressed pants, the white shirt, still there. “That man is always fucking creeping on me.” Kevin turned his neck. “Who? That person standing over there?” N. turned the wheel sharply. “He is always looking at me when I am out here,” she said, or thought she said, but her organs were writhing again, and that fever-dream miasma—black coffee, sunglasses, TV news, pale bodies, black house, chocolate loaf cake, a cup of wine—was crowding her thoughts. She thought of the girl wandering inside the Monitor Worlds. She wanted the body to wake up. She wanted the body to feel safe. What had she been doing all this time? Her hands tightened on the wheel. CLANG—and then N. was coming to herself, Kevin yelping, “Oh my GOD, what are you doing?” and when the car was stopped, she saw she had rolled into the chain-link fence, her engine was still running, and Kevin was unbuckling his seatbelt and opening the door, and the aviator was walking over, taking off his sunglasses, and saying in a light voice she had never heard, “Are you okay?” N. opened her mouth to yell something at the aviator, something like back off or get away from me! But no words came, only a choke of surprise. Coming up to her window—framed by the blue sky, concerned and kindly underneath the black sunglasses that a slender hand held aloft to the side—was the innocent and naked face of a young woman.",
    "HongmenBanquet": "The private banquet room was raucous, adrift with the sound of popping oil and clinking glasses. The waitress noted that most of the diners already bore tomato-red cheeks, their faces flushed from the flow of èrguōtóyou and rice wine. While her colleague busied herself with refilling the glasses—only for them to slosh over and empty as the customers toasted again—she brought in two more dishes and placed them on the lazy Susan, blooming with plates that had been half plucked. The patriarch was treating. Whether or not he would be the one to pay—if he would be beaten by another relative slyly passing a credit card under the table—was another question. With large parties like this, there were always at least three attendees tripping over themselves in their efforts to foot the bill. In the few months of her waitressing career, she had witnessed families sitting at cleared tables for hours arguing over the check, elbows knocking into faces in their efforts to prove filial piety. The patriarch had ordered half the menu and servers continued to stream into the room, their arms warm from the undersides of porcelain plates. Guò bǎo ròyou: square slices of pork, garnished with garlic and drizzled in Shàoxīng cooking wine. Fish heads fried in oil, their filmy eyes gazing blankly at the mouths that would bury them. Long, doughy noodles for longevity, soaked in chili oil and red vinegar, slurped down burnt throats. “This is a homecoming,” he would announced to the girl who took the order, “do not let our mouths or cups go empty.” The pièce de résistance of the feast was a thirteen-pound roast suckling pig. Its legs were splayed out comically on the platter as if the creature had been drawn and quartered. The resemblance its face once had to a pig's had been burned away—its eyes charred slits, its snout shriveled from heat. They decorated the corpse with orange slices of persimmons and clementines, pieces of pineapple, a bed of napa cabbage. Though not heavy, the platter was large and unwieldy and had to be carried by two waitresses. They nearly spilled the pig into a girl's lap as they lifted the platter over her head and onto the table. The waitress observed that this girl, sitting closest to the door, was an ABC. She would passed the back of her head, that sheet of dyed blonde hair, enough times to know. The few ABC's she encountered seemed indignant to be exposed as outsiders, thinking they could sink into Chinese society without so much as a ripple. Picking an American out of the crowd was easy, even if they wore a Chinese face. The tells were there: her Mandarin was clunky and devoid of a regional accent. She wore a thin, strappy dress that revealed tanned shoulders. The hair. Most damning was that she had choked on her first glass of èrguōtóyou, resulting in a continuous cough soothed only by an entire bowl of rice. Chopsticks frantic as she shoveled the grains into her mouth, looking to scrape the burning from her tongue. The waitress silently brought a second bowl of white rice, placing it at her side. With large, watery eyes set in a sickly face, she turned to her and said in English, “Thank you,” forgetting where she was. Which was how the waitress knew the èrguōtóyou was working. May's extended family was Northern, born and bred in Jílín since it was called Manchuria, which meant that the act of knocking back èrguōtóyou was instinctual: an inherited muscle memory. In the brutal winters, chill and slant snow cutting down to the bone, warmth came from a glass. The pooling of bái jiǔ in the stomach lent heat when heat was too expensive or firewood too dry. In the summers, swamp-like and sticky, they chased away their discomfort with drink. Ankles swollen from clusters of mosquito bites, heat stroke, frostbite—all maladies that could be cured by a generous pour. The Chinese phrase for cheers is gān bēi: to dry your cup. May was learning that the Li family took this very seriously, and several aunts and uncles had been checking her shot glass, inspecting for wayward drops. Refusing her protestations, the relatives plied her with shot after shot, toasting to her arrival. After three shots, she had learned her lesson. If she came up for air before the bottom was bone dry, she would be forced to take another full drink. Once she downed the proffered drinks, she made sure the underside was bone dry so that she could see her reflection: warped face, now green with nausea, stretched eyes converging in a tiny, pointed chin. May could no longer feel her mouth, sensation swallowed up by the acridness of the alcohol. A half-blind Baidu search beneath the table revealed that èrguōtóyou, a bái jiǔ distilled from sorghum, was 100-proof. Still, the heat and bitterness were foreign, different from the fraternity-served Everclear that she had once tried at university. Warmer, too, than the overpowering smell of bleach. Her grandfather—seventy, with the carcasses of six shot glasses spread before him—seemed unaffected. Rosacea blistered his cheeks in a permanent flush. She could never tell if he was drunk or sober. May remembered that in high school, her English class had read The Canterbury Tales. Her teacher had taught them that the Wife of Bath's red complexion was a marker for her promiscuity, her lust. Too much blood, she had explained, meant having a sanguine temperament among the four humors. In the case of May's lǎo ye, the medieval theory proved true. May's mother was one of seven children. Two were legitimate siblings, but the rest were bastards, raised in shadows by single mothers. Some of these half-siblings had found their way back to lǎo ye in the last decade, and this exposed secret was why her grandfather and May's mother were estranged. Why May's mother had protested against May's planned graduation trip to her homeland: a fight so intense that May had blacked out. She circled the memory of its resolution like tub water around the drain, the moment a strange lacuna that was just outside of May's grasp— May was poured another shot and forced to down it amidst cheers of gān bēi! The round table was crammed to bursting with Lis from different family lines reaching over one another to spin the lazy Susan and serve themselves their preferred dishes. Some of them only shared an ancestor three generations back. May was unable to differentiate between these distant cousins and her maternal uncles and aunts, her mother's half-siblings. May referred to all the relatives as Shūshu or Āyí. Men were Shūshu. Women were Āyí. Lái, lái, lái, an Āyi said, using her chopsticks to gesture toward May's empty plate. May dutifully handed it to her, and the Āyi began to pile the plate high with pinches of dishes: twice-cooked pork, chicken stewed with mushrooms, Peking duck wrapped in a pancake, pork and cabbage wontons. To top it off, a rough-cut slab of the roast pig riddled with fat deposits. Hào le, hào le, May laughed. Enough, enough. Āi yā, the aunt exclaimed, tài shòyou le. Too skinny. Other relatives nodded in agreement. May laughed again, the sound half-strangled. She knew that if she were not as thin as she was, they would chide her, prodding her with an Āi yā! Xū yào jiǎn féi! You must lose weight! Her mother had said this when May was eleven and baby fat pillowed over her bones. Her round cheeks culminating in a round body that spoke of preadolescence. Under her mother's roof, she was fed scraps all through high school: the peeled whites of eggs, the skins of tomatoes, the guts of a nearly hollowed sweet potato. Eventually, she found comfort in the way her fingers slotted between her ribs. Weaned on hunger, she craved its familiarity—the gnawing acidity shoring up along the sides of her stomach a daily lullaby. Skinny just like Fang, a Shūshu said. Another Āyi clucked her tongue, You could never put meat on Fang. She was born in the winter. January, the coldest month. A slippery wonton kept wriggling out of May's chopsticks like an earthworm burrowing back into the ground after being brought out by the rain. She left it wilting at the bottom of her full bowl. What does being born in the winter have to do with it? May asked. Měi guó mèi mei—American little sister—in Jílín when your mother was born, you could not even fill a baby's belly in the winter, an uncle answered. Yes, you should feel lucky to have so much food in front of you, an older relative lectured. The older generation smiled at her, nodded encouragingly to her plate—a signal for her to eat. They chewed with their mouths open, and in their smiles, they showed May glints of digestion through the slats of their yellow teeth. Not wanting to appear thankless, May picked at a piece of duck, forcing a close-lipped smile as she chewed. Her mouth punctured the crisp, papery skin, sunk into a cushion of fat. She held back a gag as she swallowed its softness. Here, have some more fish, a Shūshu offered, plopping a full fish head into her rice bowl. Its unblinking eyes surveyed her as she politely buried its taxidermic gaze under the starch of rice. Used to be the only place you could get seafood up here was through Dàlián, the Shūshu said, but now we can eat seafood just like the south. He picked up a shrimp, its pink, fetal curve wrapped around a chopstick, and ate it in one bite—she will, eyes, and all. Another Āyi sighed, Do you remember how we used to prepare for the winter? And now, so much food in Jílín you could gorge yourself to death on it. She was around May's mother's age, but her hair was bone white, roots and all. The ceiling light that bounced off its whiteness made May's pupils constrict. So many blisters from digging, a Shūshu groaned. We used to have to bury our vegetables, the white-haired Āyi explained to May as she leaned over to pour her more rice wine. Each fall, a truck would come to us from the countryside, carrying thousands of jīn of napa cabbages, winter radishes, potatoes. If you had the money, you could buy your vegetables early, dig out your dirt cellar before the ground got too hard. We never had the money, a Shūshu said with a full mouth, his chortle becoming a choke. Someone slapped his back hard. We would get the thin harvest and have to spend a day carving out three meters from half-frozen dirt. And if we could not dig deep enough, we would have to pickle the rest. No apples for us, an uncle said, shaking his head. Wealthier families could get hundreds of jīns of apples for the winter, but we were too poor to afford sweet things. Our tongues were made for dirt and bark and starvation. Your mother used to refuse to dig the cellar. Or dig up the snow when Ma needed vegetables from the cellar. Your mother was afraid the manual labor would harden her hands, leave her cheeks chapped and peeling from windburn. Beauty was more important to her, and it was a currency she was rich in. Well, see now how it paid off: she is in America and we are here. Her vanity got her further than our labor. Āi yā, an older Āyi cut in, shaking her head. How can you say such shallow things about a mother to her daughter? May and her mother's shallowness were intimate friends. May wanted to say she did not mind, but the Āyi barreled on. Mèi mei, she began, do not pay attention to their drunken bitterness. They have become too modern, too Western. Do not forget that filial piety to your mother is the most important virtue. In Fúzhōyou where my husband is from, they have an entire festival to celebrate mothers: Aojiu Festival. This Āyi also had white hair, cut short and permed so that the curls clung close to her head. She wore two cardigans buttoned over one another and seemed to be in her sixties. Ma, the Āyi sitting next to May groaned, Aojiu Festival is not only about filial piety. And how would you know? May blinked the film from her eyes, observing the woman next to her. Underneath the neatly styled white hair was a young face, no more than thirty-five. The skin around her eyes was unlined, free from crow's feet. The young aunt, ignoring her mother, smiled kindly at May. Aojiu Festival celebrates the dead, like today's Hungry Ghost Festival. We Northerners celebrate by burning Hell Bank Notes and paper houses for our dead. Then we ply our family's ghosts with different foods: duck, twice-cooked pork, a whole chicken, fried fish, four kinds of fruits. But in Fuzhou, they nourish their dead with Aojiu porridge. She raised a challenging gaze to her mother. Did you dye your hair, May blurted out. It was a drunk thought that became a drunk digression. She had been studying the aunt closely. The color mirrored her mother's white to the hue, but she was too young to have started graying. The Āyi's hand flew to her hair, touching the fine strands. She seemed surprised at the question, mouth opening and closing silently like a fish. Around them, conversations petered out. They turned their attention to the Āyi's answer, the silence that ensued unnatural. May looked around, confused by how the texture of the room had changed. The aunt's white head bowed sheepishly under the scrutiny, I do not know if I am the right person to tell mèi mei this story. If she should hear it all. Aunts and uncles exchanged looks with one another—their pupils flickering to each side—unsure how to answer. At last, lǎo ye said quietly, Mèi mei should know what the Japanese did to our family. So it was law, and the aunt began to tell the story. Five generations before you, May, our family lived in the northernmost part of Jílín, near the village of Hǎilín. Your lǎo ye's grandmother, your great-grandmother, had three sons before lǎo ye's father. They were good sons. All that poverty and hunger, and it just made them kind. It was the winter of 1933. They had run out of food, so their mother took them into the neighboring woods. They scavenged for willow buds, which is what the geese ate in the winter. While she was sifting her hands through the snow for whatever life she could eat, she heard the indent of feet nearby. When she looked up, she saw her younger brother, whom her eldest son had taken after: the unruly black hair, the square jaw, the red lips that she had once teased him for. But he had enlisted in the Anti-Japanese volunteer army and died a few months ago. This brother wore a straw hat and a thin, white kimono, but he had the same mannerisms. He tugged at the fingers of his other hand impatiently, smoothed his hair anxiously. So she could not help but approach him when he extended a hand, even though an innate part of her knew he was a guǐ—a ghost. This was her first mistake. He was not guǐ, but oni—a Japanese demon brought to the mainland by the Kwantung Army. He lived with the doctors and officers in Hǎilín, where they had established Unit 643, a sister branch to 731 in Píngfáng. The oni did the doctors' bidding, because they would struck a deal. They fed him the bodies of their failed experiments to keep their war crimes hidden. What did the oni care if his meat had been infected with anthrax? For all the centuries he had been alive, he had never seen so many bodies, laid out for him like a feast. The Japanese had no use for the corpses after they had died. They called the Chinese maruta—lumber—and they said they were just felling trees. Clearing the forest. And the oni—well, he had gotten used to gluttony, so he stayed in Hǎilín. The doctors and officers alike had asked him to bring back a woman, preferably of child-bearing age, but they would take a girl too. He had seen the woman in the forest, and though she had little meat on her bones, she had red in her cheeks and long, dark hair, and he knew the men would be pleased. He saw that she wore a mourning band on her left sleeve, so he shifted into her loss. At first, she came willingly. But. But she knew her brother's hand from the years of leading him around, and this was not his hand. She began to thrash and scream, yelling for her sons to run, but the oni was strong and he dragged her through the snow, leaving a trench dug by her body in their wake. Her eldest son saw his mother being pulled to Hǎilín, and he hid his younger brothers in a hollow tree, deep in its roots, so that the underground would keep them warm. He ignored her warnings and chased after her. When the Japanese men saw the mother, they were pleased, but they did not take her like they had so many other women. (Always in cells, always at gunpoint.) Instead, they had devised a new experiment. A hybrid child. They made the oni shift into its true form: eight feet tall, skin as blue as frostbite, a jaw as wide as her head. Yawning open, it revealed a set of sharp canines. Two horns spun out of its head. And when she wanted to die from this sight, they had it consume her, rutting its hips into her, its three-fingered hands leaving bruises the color of its skin on the bones of her pelvis. The mother lost consciousness. She believed she would died, and her spent body mimicked death so well that the Japanese threw her out in the snow—a maruta not even worth kindling now. Just another failed experiment. The son had been trailing the mother and the oni, their deep tracks easy to follow. He saw it take her into the facility, and he lingered in the surrounding woods, waiting for dark. But the oni was not the only yōkai at Hailin. They had brought over a yuki-onna for the doctors' hypothermia experiments. Like the oni, they had lured her in by the sheer number of bodies: a line of men in the snow that she could freeze to death, whose souls she could slurp up through their blued lips. Sometimes the doctor had her leave them alive, freezing a limb until a finger or toe fell off. The doctor liked watching the skin of the maruta turn black under the yuki-onna's breath, hit the frozen limbs with his cane until the sound was the same as a thwack against wood. That day, there were no frostbite experiments, so the yuki-onna drifted in the cold, where she was comfortable. The son did not see her, because she had white skin and wore a white kimono, blending in with the winter landscape. She saw him, and because she was hungry, she did not bother freezing him before sucking at his life. Her teeth notched into his soul, tugging, but when she faced him, she saw that he was just a boy, not a man, an innocent, and her mouth opened. In that small bite, she had already leeched out the color from his hair, leaving it as white as her skin. The boy tore himself away from the yuki-onna, and his soul dropped back into his body. When he looked up, she was gone, icicles in the place she had been floating. Now every Li descended from this eldest son is born with white hair, that missing heirloom still pickled in a demon's belly. The son saw his mother, stripped of her clothes, thrown in the snow. When it was dark, he carried her to the tree with his brothers and waited out the night before going home. Her eyes were gaping open, jellied, but there was no familiarity there. She had let the white-haired boy tug her away, though she did not know who he was. She remained in this chrysalis—her sons fed her broth, closed her open eyes at dusk—until she reached the third trimester. At which time, she woke. In Chinese numerology, the number four, sì, is unlucky, because it sounds like the character for death, sǐ. This fourth son, growing in her belly, was unlucky for other reasons. For the last two months before she would give birth, she tried to kill him in the womb. She gathered thuja, safflower, silver wormwood, and crushed them into her tea, which she drank daily. But he would not die. If he would not die, then maybe he would survive the North after all. When he was born, she loved him unwillingly. She saw that he was still half-human: half her. His skin was the color of moss—blue and yellow mixed—as if his whole body was covered by a Mongolian mark. The two bumps on his hairline the only other sign that something was amiss. This, you see, was your lǎo ye's father. Oh dear, we have upset you. Have not we, May? You do look a little green. The Āyi fretted, her hands flitting nervously in her lap. May's throat had gone dry. She had heard this story before. Recently. When? May felt everyone is eyes turned toward her, searing onto her skin, their bloodshot pupils wet with pity. Was she crying? May reached a hand to wipe the corners of her eyes, but when she felt her cheek, it was oozing—a half-state between liquid and solid. Her fingers came away with elastic, red cheek meat. She held up a shot glass, looked at her reflection. Her skin was melting off, sloughing down her bones in ruddy drips. She blinked. She looked up at her family. The pity in their faces intensified. What is happening? May asked, panic in her voice, though some innate part of her knew. It is almost time for you to go, lǎo ye said. We hope you had a good meal. We did not want to tell you, a Shūshu said. You seemed so content, an Āyi said. But you asked. You should not have asked. Not now and not then. When? May asked. The flesh of her eyelids started running in rivulets until there were no eyelids, only the bulge of her naked eyes in their sockets. May, we know you remember. Think back, how did you get here? You cannot remember, can you? You cannot remember packing or sitting on the plane. It was spring break. You were home, and you asked Fang. You asked her why she did not want you to visit us. She told you we were no good, that a whole ocean was not wide enough to get away from us. Us and our bad blood. Us and our monstrosity. You asked her to explain, and she did. But May, you could not live another moment with this inheritance. Fang called home when she found your body. We had not heard from her in years. She remembers the smell. Burnt beyond recognition, the soft parts corroded: the eyes, the nose, the mouth. Fat liquefying into pearlescent soap bubbles, shimmering with color, until the bone and garish red muscle were exposed under the fluorescent lights: shiny and open. Drowned in a bathtub of bleach to burn off the otherness, the oni-ness. No, May wanted to protest, that is not right. But her tongue was burning, breaking down in her mouth, and she was remembering. The aftermath. The realization that she could feel no comfort with her existence. Washing her hands with the bottle of bleach under the bathroom sink until they blistered. Scrubbing away at the revulsion for herself that ran bone-deep, blood-deep, and her swollen, pustuled hands pouring the bleach into the tub, gripping the sides as she lowered herself in. How she sighed at the cleanliness she felt in the flaying pain before— We will see you again next Hungry Ghost Festival.",
    "LoveYouToPieces": "I found her in pieces discarded on the sidewalk: an old apothecary cabinet with blackened silver knobs, each bin a lost secret, a pile of shattered drawers that had once been used to put away delicate lingerie, a mannequin's head, chest-less arms. I made her whole again, cleaned every surface, and every nook with the most care one could expect from a carpenter like myself. Removed lint, stains, buffed, repainted, re-nailed, and layered her with the creamiest varnish, her body reconstructed with a hundred drawers ready to put our memories together. I gave her the mannequin's head, covered it with ebony flying hair, drew fleshy pink lips, and affixed her freshly waxed arms. I lathered her with my love, and she trembled alive. She smelled cedar and her laughter crisp like a Spring breeze. I called her Annie, and she loved me back with all her might. She was curious of our human-made technology and was particularly fascinated with the smartphone. She wanted one grafted on her left palm and I obliged—we even named it pholm—so she could constantly be checking her texts and tapping back love notes to me. We were pholm-tethered while I was away from her, shaping chairs and stools from rugged wood at the furniture company. Besides binging on NetFilm, I was her sole occupation. She fretted when my replies took longer than a minute to appear on her screen. There were other issues between us, like all couples do. When we hugged, her drawer knobs poked my chest, the sharp corner of her shoulders made a dent on my chin when I fell asleep on her, we could not spoon each other without pinching my calf on her hinges or bumping my big toe against one of her panels. I almost stepped on the screen of her pholm once while messing around. My clumsiness infuriated her. Her pholm was like her lifeline, a vein bringing oxygen to her heart. She thrived on efficiency, a press on her pholm would bring Chinese take-out when I was too tired to cook from a long workday, bathroom tissues she had forgotten to purchase, or a YouRide if we needed to get to the movies, everything had to be at the tip of her thumb. She lapped up all the romantic movies, like That Christmas I Met You and whispered dialogs she would heard to my ear as I fell asleep on the couch. She treasured my words and stored them in her tiny drawers of her cabinet body, kept them wrapped in tissues, and would pull them out to hear them again like favorited songs. She had a special drawer for I love you when I said it to her the first time. She would take it out to remind me I have not said the phrase for a while. She loved asking questions like, what would I do if I could go back to the past, who I had lunch with, when did I know I loved her. She catalogued and compartmentalized each sentence into her carefully organized drawers. Over time, she began opening and pulling out every word I had shared with her. What would I be doing if we had not met? I said I would not know, maybe I would be with someone else. That earned me an entire day of silent treatment. That time I mentioned I danced with my colleague Evie at the company Christmas party. That was too intimate. That time I mentioned an ex-girlfriend. That was disrespectful. That time I told her I needed some space. That was insulting. That time I refused to be Super Glued to her hip. That was degrading. I had become her experiment, I did not pass her secret exam, and every answer I gave turned into red flags in her book. I told her, it was not working anymore, she and I. We fought. Drawers banging, door slamming. She cried, I cried. She sloshed back all the tears I she would into her chest. Threw me and my tools out on the street. Said it was lame for a man to cry.",
    "MissFreckle": "There is a freckle who lives on my nipple, on the southwest corner of my right breast. I would give you the exact longitude and latitude, but only if you promise to kiss her right, the way that makes her sigh not yell, blow on her gently like you would when wishing on a fallen eyelash, lick her like a crumb of your most favorite dessert that you cannot bear to let go to waste. Miss Freckle has traveled the world. She has dangled off a mountain edge in Cuzco, eaten ant eggs in Mexico City, fought with night market vendors in Penang, nestled comfortably among the redwoods in Big Sur. She has felt the cool wash of waterfalls, the dry heat of deserts, the sticky sweat of tropical beaches, the mosquito bites of jungles. She has felt the back of hands, rough and wanting, soft and waiting. She has tasted breath and saliva, the delicate amylase both sweet and sour, warm first when the lips land, then cool when the mouth lifts. She is direct, determined, looks you in the eye and tells you what she wants and how she wants it. In certain circles she is a celebrity, whispered about in the most hushed of tones, the perfect size and shape. The thing is — some men do not listen to Miss Freckle. I have heard her mutter, then murmur, then shout, then scream, all the things she wants, faster, slower, more, less, not today, please not today, tomorrow, I have a headache, I hate you, go away, no no no, and still, the angry hands arrive, persistent, sweating, entitled, determined to take what they want, yet forgetting to give what was asked. The women inflict their violence in different ways — in snide, sideways looks that say she was asking for it, in hushed voices that whisper, well he has always been nice to me, in spiteful glances that hiss you know it is lopsided right? Mothers and aunts and sister urge Miss Freckle to limit access, create doors, gates, and bouncers with bras, shirts, and sweaters. Everyone reminds Miss Freckle that only men get to wear their desire openly; that for women to display want is gluttony, and no one wants to be around that kind of shame. All of it makes Miss Freckle rage, and this rage makes her bulge, the little brown fleck becoming a spot, and then mole, and then a wart filled with pus, swollen, imbalanced, in pain. I take Miss Freckle to the doctor who prods and pokes her; she holds her breath, taut and hurting, tears leaking out of her corners. The doctor tells me she has to go; she has become a growth, benign yes, but a menace; he says he will lance her off, says there will be no pain, no scar, and I will not even remember she was there to begin with. Miss Freckle shakes so hard I feel her quivers pass through my ribs. “Make it stop,” she pleads, “Do not let them take me away.” I feel so bad for her, so furious at everyone who disregards her desires, her wants, her agency. I whisper that I will care for her, that no one will get to lance her, or bite her, or hurt her or shame her, disappear her, without her permission. I take her home and soothe her, make a warm compress and press her bulging sides gently, rub cool ointment on her. At first, I feel her throb against the nipple distrustfully. Then I feel her relax. The swelling subsides, her edges smoothen, her contours go back to the symmetrical brown roundness I used to know. After a week indoors, just the two of us, I take her outside. The sun peeks through the clouds as though to spotlight our re-emergence, reminding us of the joy of our togetherness away from prying eyes and pressing hands. A mynah bird whistles, then the leaves of the angsana trees whistle too as the breeze sneaks by. Miss Freckle arches in my nipple, peeps through my shirt, turns her brown face towards the sun, and sighs a long, happy sigh.",
    "SmokeAndFish": "Ong Hai is the one who teaches me about the smoke. It had been around before I was born, rising up and up, curling over heads, drifting past trees and waste and punishment. Ong Hai once told me that every time it rained, birds would shelter under the eaves of his sheet metal roof and do nothing but cough, cough, cough. But he said that was years ago and their throats were all scraped songless, and now whenever a storm hunched over them, they would fly from tree to tree with their mouths splayed open, netting the rain like fish, feasting on what the sky owed them, the thunder. I have never heard thunder, but a part of me wonders if it is like live meat falling out of the sky in a cardinal rain: a rain that is been souring the water, settling acrid like a curse on the tongue. At first everyone blamed the smoke on the war, then the steel plant, and, finally, the water. But Ong Hai says it is not water but grief at the bottom of the sea. He explains that there was a banyan on the moon, a many-limbed tree with shadows long enough to floss out the stars, and leaves that could heal the body tofu-blank, that extracted pain like a tooth. After a thousand years of foreign invasion the Jade Emperor summoned the banyan down, shaped it into a container, and flung it into the sea to hold grief deep enough to swallow anything: tanks, doorknobs, rice bowls, flames, cities, whole cows, the names that stoned in our throats, bridged us at our backs. I imagine the container grained and glittering, swelling with light—light like salt in the water, light like ghost teeth. I have never found it but Ong Hai did. He told me that as a boy, he contracted dysentery on a French military ship and found himself at the bottom of the South China Sea. He was the first kid on the ship to spot the container. Thinking it was stuffed with rice the Japanese stole, he tried to smash it open and come home a hero, and by the time he made a dent, he had no skin left. He was that kind of boy, all bones, homeless. He is still alive, of course. When the container did not open he sat on the seafloor and cried and cried until he became fluent in salt, the ocean. That is when it opened, Ong Hai said–opened up wide as rivers, took him in, shrouded him entirely like the dead. And when he came back up, he was older and had an accent and knew loss so well he floated through the world as if his body was made of nothing. Apparently he would been at the seafloor for almost five generations until grief was discovered by a group of divers in the mid-2010s. They were searching for the source of cyanide in the ocean, which had led to the death of tons of fish, clams, shrimp, and cuttle in over four coastal provinces, as well as four hospitalizations caused by seafood poisoning. The day Ong Hai re-emerged, there were so many dead fish floating on the water that you could walk like Jesus across the surface of the sea, all the way to China, or that is what he claims. The oldest diver was the first to spot the container and was also the one charged with breaking it. But according to Ong Hai, the container had already been shrinking. That is how fish get to heaven, he told me one morning. It is because grief’s been escaping. Fixing wings on them. He pointed the golden sprig of his finger up into the sun and light streamed into it like rain. I tilted my head up and squinted as if I could see it: being outfitted with flight, bones inhaling more air, more oxygen. That evening in early spring, the container crumbled in the diver’s hands and all remaining captive grief had broken free. The final grief to escape is believed to have originated from the ghosts of the dead themselves. It rushed at the diver as if it had been waiting, and there were rumors after that when soldiers in pond-green uniforms came to arrest the diver the next morning, they found him on his back, in bed, spirits billowing out his mouth like incense, the air carrying names on its tongue. Local officials have been blaming a Taiwanese plastic company for causing the smoke, but Ong Hai thinks it is them. They are rounding up the dead fish, he said, converting them to coal. He says that is why you do not see bodies flaking the sand anymore, why the wind smells like scorched beach, like cartilage soaked in sodium. Fish are being burned until another sky scrolls white over us, making another light, the clouds knitting together by the lineage of their bones. I ask Ong Hai what happens to burned fish if all the grief is gone, and he laughs at me. No, he says, just look at the sky. It is still bringing them up, bringing them to their next lives. If you were dead you would see it. You would see it everywhere."
}